rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/aon_reg.h
/*
 * Copyright (c) 2024 Realtek Semiconductor Corp.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _AON_REG_H
#define _AON_REG_H
#include <stdint.h>

/* Auto gen based on RL6920_B_Cut_AON_Autogen_table_2023_0612_V1.xlsx */
#define AON_FAST_BOOT                   0x400
#define AON_FAST_REBOOT_SW_INFO0        0x404
#define AON_REG4X_FW_GENERAL            0x408
#define AON_DEBUG_PASSWORD              0x40C   // 0x40C ~ 0x41B store the debug password
#define AON_REG8X_FW_GENERAL            0x410
#define AON_REG10X_FW_GENERAL           0x414
#define AON_REG12X_FW_GENERAL           0x418
#define AON_REG14X_FW_GENERAL           0x41C
#define AON_REG16X_FW_GENERAL           0x420
#define AON_REG18X_FW_GENERAL           0x424
#define AON_REG20X_FW_GENERAL           0x428
#define AON_REG22X_FW_GENERAL           0x42C
#define AON_REG0X_FUNC_DIS              0x460
#define AON_REG0X_SAF                   0x464
#define AON_REG1X_SAF                   0x468
#define AON_REG0X_SC                    0x46C
#define AON_REG0X_KM4_DBG_CTRL          0x470
#define AON_RTC_PF_COMP_CONTROLLER_REG  0x4B0
#define AON_RTC_PF_COMP0_REG            0x4B4
#define AON_RTC_PF_COMP1_REG            0x4B8
#define AON_RTC_PF_COMP2_REG            0x4BC
#define AON_RTC_PF_COMP3_REG            0x4C0
#define AON_RTC_PF_COMP_MANUAL_INT_REG  0x4C4
#define AON_RTC_PF_CNT_REG              0x4C8
#define AON_RTC_PF_COMP_INT_WK_CLR_REG  0x4CC
#define AON_RTC_PF_COMP_INT_WK_SR_REG   0x4D0
#define AON_RTC_PF_RTL_VERSION_REG      0x4D4
#define AON_BT_MAC_VSEL                 0x580
#define AON_BT_MAC_SNPS_HV_LV           0x584
#define AON_BT_MAC_1024x16_PWR          0x588
#define AON_BT_MAC_512x16_PWR           0x58C
#define AON_BT_MAC_128x32_0_PWR         0x590
#define AON_BT_MAC_128x32_1_PWR         0x594
#define AON_BT_MAC_640x32_HV_LV         0x598
#define AON_BT_MAC_640x32_PWR           0x59C
#define AON_BT_MAC_96x32_HV_LV          0x5A0
#define AON_BT_MAC_96x32_PWR            0x5A4
#define AON_BT_MAC_64x32_HV_LV          0x5A8
#define AON_BT_MAC_64x32_PWR            0x5AC
#define AON_ZB_MAC_VSEL                 0x5B0
#define AON_ZB_MAC_HV_LV                0x5B4
#define AON_ZB_MAC_16x32_PWR            0x5B8
#define AON_ZB_MAC_40x32_PWR            0x5BC
#define AON_ZB_MAC_32x32_PWR            0x5C0
#define AON_BT_PHY_VSEL                 0x5C4
#define AON_BT_PHY_HV_LV                0x5C8
#define AON_BT_PHY_128x12x4_PWR         0x5CC
#define AON_BT_PHY_LR_RAM_PWR           0x5D0
#define AON_KM4_VSEL                    0x5D4
#define AON_KM4_ITCM0_HV_LV             0x5D8
#define AON_KM4_ITCM0_LS                0x5DC
#define AON_KM4_TCM_HV_LV               0x5E0
#define AON_KM4_ITCM1_PWR_0             0x5E4
#define AON_KM4_ITCM1_PWR_1             0x5E8
#define AON_KM4_DTCM0_PWR               0x5EC
#define AON_KM4_DTCM1_PWR               0x5F0
#define AON_KM4_IC_DATA_HV_LV           0x5F4
#define AON_KM4_IC_DATA_PWR             0x5F8
#define AON_KM4_IC_TAG_HV_LV            0x5FC
#define AON_KM4_IC_TAG_PWR              0x600
#define AON_KM4_DC_DATA_HV_LV           0x604
#define AON_KM4_DC_DATA_PWR             0x608
#define AON_KM4_DC_TAG_HV_LV            0x60C
#define AON_KM4_DC_TAG_PWR              0x610
#define AON_BUFFER_RAM_VSEL             0x614
#define AON_BUFFER_RAM_HV_LV            0x618
#define AON_BUFFER_RAM_PWR              0x61C
#define AON_DATA_RAM_VSEL               0x620
#define AON_DATA_RAM_HV_LV              0x624
#define AON_DATA_RAM_PWR                0x628
#define AON_USB_VSEL                    0x62C
#define AON_USB_HV_LV                   0x630
#define AON_USB_PWR                     0x634
#define AON_SDIO_RAM_PWR                0x638
#define AON_DISPLAY_128x32_PWR          0x63C
#define AON_DISPLAY_672x24_PWR          0x640
#define AON_GMAC_PWR                    0x644
#define AON_PKE_ROM_HV                  0x648
#define AON_PKE_ROM_PWR                 0x64C
#define AON_PKE_MMEM_PWR                0x650
#define AON_PKE_TMEM_PWR                0x654
#define AON_AUDIO_VSEL                  0x658
#define AON_AUDIO_HV_LV                 0x65C
#define AON_AUDIO_AD_PWR                0x660
#define AON_AUDIO_DA_PWR                0x664
#define AON_CAN_VSEL                    0x668
#define AON_CAN_HV_LV                   0x66C
#define AON_CAN_PWR                     0x670
#define AON_REG0X_SYS                   0x800
#define AON_REG1X_SYS                   0x804
#define AON_REG2X_SYS                   0x808
#define AON_REG3X_SYS                   0x80C
#define AON_REG4X_SYS                   0x810
#define AON_REG5X_SYS                   0x814
#define AON_REG6X_SYS                   0x818
#define AON_REG7X_SYS                   0x81C
#define AON_REG8X_SYS                   0x820
#define AON_REG9X_SYS                   0x824
#define AON_REG10X_SYS                  0x828
#define AON_REG0X_EFUSE                 0x82C
#define AON_REG0X_XPDCK                 0x830
#define AON_REG0X_PWM_POS               0x834
#define AON_REG0X_PFM_POS               0x838
#define AON_REG0X_300K                  0x83C
#define AON_REG1X_300K                  0x840
#define AON_AON_READ_RG0X               0x844
#define AON_AON_READ_RG1X               0x848
#define AON_AON_READ_RG2X               0x84C
#define AON_AON_READ_RG3X               0x850
#define AON_AON_READ_RG4X               0x854
#define AON_AON_READ_RG5X               0x858
#define AON_AON_READ_RG6X               0x85C
#define AON_AON_READ_RG7X               0x860
#define AON_AON_READ_RG8X               0x864
#define AON_AON_READ_RG9X               0x868
#define AON_AON_READ_RG10X              0x86C
#define AON_AON_READ_RG11X              0x870
#define AON_AON_READ_RG12X              0x874
#define AON_AON_READ_RG13X              0x878
#define AON_AON_READ_RG14X              0x87C
#define AON_AON_READ_RG15X              0x880
#define AON_AON_READ_RG16X              0x884
#define AON_LOP_RG0X                    0xAB0
#define AON_LOP_RG1X                    0xAB4
#define AON_LOP_RG2X                    0xAB8
#define AON_LOP_RG3X                    0xABC
#define AON_LOP_RG4X                    0xAC0
#define AON_LOP_RG5X                    0xAC4
#define AON_LOP_RG6X                    0xAC8
#define AON_LOP_RG7X                    0xACC
#define AON_LOP_RG8X                    0xAD0
#define AON_LOP_RG9X                    0xAD4
#define AON_LOP_RG10X                   0xAD8
#define AON_REG0X_MBIAS                 0xC00
#define AON_REG2X_MBIAS                 0xC04
#define AON_C_KOUT0X_MBIAS              0xC08
#define AON_REG0X_LDO                   0xC10
#define AON_REG2X_LDO                   0xC14
#define AON_REG0X_LCD                   0xC18
#define AON_REG0X_BUCK                  0xC20
#define AON_REG2X_BUCK                  0xC24
#define AON_REG4X_BUCK                  0xC28
#define AON_REG6X_BUCK                  0xC2C
#define AON_REG8X_BUCK                  0xC30
#define AON_C_KOUT0X_BUCK               0xC34
#define AON_REG0X_32KXTAL               0xC80
#define AON_REG2X_32KXTAL               0xC84
#define AON_REG0X_32KOSC                0xC88
#define AON_REG_POW                     0xC8C
#define AON_REG0X_40MOSC                0xC90
#define AON_REG0X_RCAL                  0xC94
#define AON_BT_ANAPAR_XTAL_mode         0xCA0
#define AON_BT_ANAPAR_XTAL0             0xCA4
#define AON_BT_ANAPAR_XTAL2             0xCA8
#define AON_BT_ANAPAR_XTAL4             0xCAC
#define AON_BT_ANAPAR_XTAL6             0xCB0
#define AON_BT_ANAPAR_XTAL8             0xCB4
#define AON_BT_ANAPAR_XTAL10            0xCB8
#define AON_BT_ANAPAR_XTAL12            0xCBC
#define AON_BT_ANAPAR_XTAL14            0xCC0
#define AON_BT_ANAPAR_XTAL16            0xCC4
#define AON_REG0X_XTAL                  0xCC8
#define AON_REG1X_XTAL                  0xCCC
#define AON_REG0X_BT_ANAPAR_LDO         0xCD0
#define AON_REG0X_RF_LDO318             0xCD4
#define AON_REG0X_LDO_PLL1              0xD00
#define AON_REG_USB_POWER_CTL           0xD40
#define AON_REG_USB_CLK_CTL             0xD44
#define AON_REG_XTAL0                   0xD60
#define AON_REG_XTAL1                   0xD64
#define AON_REG0X_PLL1                  0xD80
#define AON_REG2X_PLL1                  0xD84
#define AON_REG0X_PLL2                  0xD88
#define AON_REG2X_PLL2                  0xD8C
#define AON_REG4X_PLL2                  0xD90
#define AON_RO_PLL                      0xD94
#define AON_NS_RTC_CR0                  0x1800
#define AON_NS_RTC_INT_clear            0x1804
#define AON_NS_RTC_INT_SR               0x1808
#define AON_NS_RTC_PRESCALER0           0x180C
#define AON_NS_RTC_COMP_0               0x1810
#define AON_NS_RTC_COMP_1               0x1814
#define AON_NS_RTC_COMP_2               0x1818
#define AON_NS_RTC_COMP_3               0x181C
#define AON_NS_RTC_COMP0_GT             0x1820
#define AON_NS_RTC_COMP1_GT             0x1824
#define AON_NS_RTC_COMP2_GT             0x1828
#define AON_NS_RTC_COMP3_GT             0x182C
#define AON_NS_RTC_CNT0                 0x1830
#define AON_NS_RTC_PRESCALE_CNT0        0x1834
#define AON_NS_RTC_PRESCALE_CMP0        0x1838
#define AON_NS_RTC_BACKUP_REG           0x183C
#define AON_NS_RTC_RTL_VERSION0         0x1840
#define AON_NS_LPC0_CR0                 0x1850
#define AON_NS_LPC0_SR                  0x1854
#define AON_NS_LPC0_MBIAS               0x1858
#define AON_NS_P0_0_P0_1_PAD_CFG        0x1900
#define AON_NS_P0_2_P0_3_PAD_CFG        0x1904
#define AON_NS_P0_4_P0_5_PAD_CFG        0x1908
#define AON_NS_P0_6_P0_7_PAD_CFG        0x190C
#define AON_NS_P1_0_P1_1_PAD_CFG        0x1910
#define AON_NS_P1_2_P1_3_PAD_CFG        0x1914
#define AON_NS_P1_4_P1_5_PAD_CFG        0x1918
#define AON_NS_P1_6_P1_7_PAD_CFG        0x191C
#define AON_NS_P2_0_P2_1_PAD_CFG        0x1920
#define AON_NS_P2_2_P2_3_PAD_CFG        0x1924
#define AON_NS_P2_4_P2_5_PAD_CFG        0x1928
#define AON_NS_P2_6_P2_7_PAD_CFG        0x192C
#define AON_NS_P3_0_P3_1_PAD_CFG        0x1930
#define AON_NS_P3_2_P3_3_PAD_CFG        0x1934
#define AON_NS_P3_4_P3_5_PAD_CFG        0x1938
#define AON_NS_P3_6_P3_7_PAD_CFG        0x193C
#define AON_NS_P4_0_P4_1_PAD_CFG        0x1940
#define AON_NS_P4_2_P4_3_PAD_CFG        0x1944
#define AON_NS_P32K_XI_P32K_XO_PAD_CFG  0x1948
#define AON_NS_P_MICBIAS_PAD_CFG        0x194C
#define AON_NS_COMMON_PAD_CFG           0x1950
#define AON_NS_P_SPI_PAD_CFG            0x1954
#define AON_NS_DAC_P_DAC_N_PAD_CFG      0x1958
#define AON_NS_P4_4_P4_5_PAD_CFG        0x195C
#define AON_NS_P4_6_P4_7_PAD_CFG        0x1960
#define AON_NS_P5_0_P5_1_PAD_CFG        0x1964
#define AON_NS_P5_2_P5_3_PAD_CFG        0x1968
#define AON_NS_P5_4_P5_5_PAD_CFG        0x196C
#define AON_NS_P5_6_P5_7_PAD_CFG        0x1970
#define AON_NS_P6_0_P6_1_PAD_CFG        0x1974
#define AON_NS_P6_2_P6_3_PAD_CFG        0x1978
#define AON_NS_P6_4_P6_5_PAD_CFG        0x197C
#define AON_NS_P6_6_P6_7_PAD_CFG        0x1980
#define AON_NS_P7_0_P7_1_PAD_CFG        0x1984
#define AON_NS_P7_2_P7_3_PAD_CFG        0x1988
#define AON_NS_P7_4_P7_5_PAD_CFG        0x198C
#define AON_NS_P7_6_P7_7_PAD_CFG        0x1990
#define AON_NS_SPIC0_PAD_CFG0           0x1994
#define AON_NS_SPIC0_PAD_CFG1           0x1998
#define AON_NS_SPIC0_PAD_CFG2           0x199C
#define AON_NS_P8_0_P8_1_PAD_CFG        0x19A0
#define AON_NS_P8_2_P8_3_PAD_CFG        0x19A4
#define AON_NS_P8_4_P8_5_PAD_CFG        0x19A8
#define AON_NS_P8_6_P8_7_PAD_CFG        0x19AC
#define AON_NS_P9_0_P9_1_PAD_CFG        0x19B0
#define AON_NS_P9_2_P9_3_PAD_CFG        0x19B4
#define AON_NS_P9_4_P9_5_PAD_CFG        0x19B8
#define AON_NS_P9_6_P9_7_PAD_CFG        0x19BC
#define AON_NS_P10_0_P10_1_PAD_CFG      0x19C0
#define AON_NS_P10_2_P10_3_PAD_CFG      0x19C4
#define AON_NS_PAD_E3_CFG               0x19C8
#define AON_NS_PAD_Status_0             0x1AA0
#define AON_NS_PAD_Status_1             0x1AA4
#define AON_NS_PAD_Status_2             0x1AA8
#define AON_NS_REG0X_DEBIO              0x1AAC
#define AON_NS_PAD_Status_3             0x1AB0
#define AON_NS_REG0X_APP                0x1AE0
#define AON_NS_REG1X_APP                0x1AE4
#define AON_NS_REG2X_APP                0x1AE8
#define AON_NS_REG3X_APP                0x1AEC
#define AON_NS_REG4X_APP                0x1AF0
#define AON_NS_REG5X_APP                0x1AF4
#define AON_NS_REG6X_APP                0x1AF8
#define AON_NS_REG7X_APP                0x1AFC
#define AON_NS_REG8X_APP                0x1B00
#define AON_NS_REG9X_APP                0x1B04
#define AON_NS_REG10X_APP               0x1B08
#define AON_NS_REG11X_APP               0x1B0C
#define AON_NS_REG12X_APP               0x1B10
#define AON_NS_REG13X_APP               0x1B14
#define AON_NS_REG14X_APP               0x1B18
#define AON_NS_REG15X_APP               0x1B1C
#define AON_NS_AON_WDG_WP0              0x1B60
#define AON_NS_AON_WDG_CONFIG           0x1B64
#define AON_NS_AON_WDG_CNT_RESET0       0x1B68
#define AON_NS_AON_WDG_SEC_CTL          0x1B6C
#define AON_NS_REG0X_LDO                0x1B90
#define AON_NS_REG0X_AUX_V09            0x1B94
#define AON_NS_REG0X_SD                 0x1B98
#define AON_NS_REG_CONFIG               0x1BD0
#define AON_NS_REG_SR_X                 0x1BD4
#define AON_NS_INT_CLR                  0x1BD8
#define AON_NS_REG30_CORE_KM4_PC        0x1C00
#define AON_NS_REG34_CORE_KM4_LR        0x1C04
#define AON_NS_REG38_CORE_KM4_PC_EX     0x1C08
#define AON_NS_REG3C_CORE_KM4_XPSR_R    0x1C0C
#define AON_NS_REG40_CORE_KM4_MSP_S     0x1C10
#define AON_NS_REG44_CORE_KM4_PSP_S     0x1C14
#define AON_NS_REG48_CORE_KM4_MSP_NS    0x1C18
#define AON_NS_REG4C_CORE_KM4_PSP_NS    0x1C1C
#define AON_NS_REG50_AON_KM4_PC         0x1C20
#define AON_NS_REG54_AON_KM4_LR         0x1C24
#define AON_NS_REG58_AON_KM4_PC_EX      0x1C28
#define AON_NS_REG5C_AON_KM4_XPSR_R     0x1C2C
#define AON_NS_REG60_AON_KM4_MSP_S      0x1C30
#define AON_NS_REG64_AON_KM4_PSP_S      0x1C34
#define AON_NS_REG68_AON_KM4_MSP_NS     0x1C38
#define AON_NS_REG6C_AON_KM4_PSP_NS     0x1C3C
#define AON_NS_REG_AON_WDT_MODE         0x1C40
#define AON_NS_REG_KM4_WDT_MODE         0x1C44
#define AON_NS_REG0X_FW_GENERAL_NS      0x1D00
#define AON_NS_REG2X_FW_GENERAL_NS      0x1D04
#define AON_NS_REG4X_FW_GENERAL_NS      0x1D08
#define AON_NS_REG6X_FW_GENERAL_NS      0x1D0C
#define AON_NS_REG8X_FW_GENERAL_NS      0x1D10
#define AON_NS_REG10X_FW_GENERAL_NS     0x1D14
#define AON_NS_P3_P1_PAD_E_LCD_CFG      0x1D80
#define AON_NS_P7_P4_PAD_E_LCD_CFG      0x1D84
#define AON_NS_P11_P8_PAD_E_LCD_CFG     0x1D88
#define AON_NS_P3_P1_PAD_SHDN_LCD_CFG   0x1D8C
#define AON_NS_P7_P4_PAD_SHDN_LCD_CFG   0x1D90
#define AON_NS_P11_P8_PAD_SHDN_LCD_CFG  0x1D94
#define AON_NS_REG0X_SDADC_LDO          0x1DC0
/* 0x400    0x4000_0400
    15:0    R/W FW_GENERAL_REG0X                        16'h0
    31:16   R/W FW_GENERAL_REG1X                        16'h0
 */
typedef volatile union _AON_FAST_BOOT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_GENERAL_REG0X: 16;
        uint32_t FW_GENERAL_REG1X: 16;
    };
} AON_FAST_BOOT_TYPE;

/* 0x404    0x4000_0404
    15:0    R/W FW_GENERAL_REG2X                        16'h0
    31:16   R/W FW_GENERAL_REG3X                        16'h0
 */
typedef volatile union _AON_FAST_REBOOT_SW_INFO0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_GENERAL_REG2X: 16;
        uint32_t FW_GENERAL_REG3X: 16;
    };
} AON_FAST_REBOOT_SW_INFO0_TYPE;

/* 0x408    0x4000_0408
    15:0    R/W FW_GENERAL_REG4X                        16'h0
    31:16   R/W FW_GENERAL_REG5X                        16'h0
 */
typedef volatile union _AON_REG4X_FW_GENERAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ota_valid: 1;                  /* bit[0]: ota valid */
        uint32_t is_rom_code_patch: 1;          /* bit[1]: is rom code patch ? */
        uint32_t is_fw_trig_wdg_to: 1;          /* bit[2]: does fw trigger watchdog timeout ? */
        uint32_t is_send_patch_end_evt: 1;      /* bit[3]: does we send patch end event ? */
        uint32_t rsvd: 2;                       /* bit[5:4]: reserved */
        uint32_t is_airplane_mode : 1;          /* bit[6]: is airplane mode ? */
        uint32_t REBOOT_SW_INFO1: 6;            /* bit[12:7] for AON_FAST_REBOOT_SW_INFO1 */
        uint32_t is_password_mpl_cmd: 1;
        uint32_t reg_aon_hwspi_en: 1;
        uint32_t reg_aon_debug_port: 1;
        uint32_t FW_GENERAL_REG5X: 16;
    };
} AON_REG4X_FW_GENERAL_TYPE;

/* 0x40C    0x4000_040c
    15:0    R/W freg2                        16'h0
    31:16   R/W freg3                        16'h0
 */
typedef volatile union _AON_DEBUG_PASSWORD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t freg2: 16;
        uint32_t freg3: 16;
    };
} AON_DEBUG_PASSWORD_TYPE;

/* 0x410    0x4000_0410
    15:0    R/W FW_GENERAL_REG8X                        16'h0
    31:16   R/W FW_GENERAL_REG9X                        16'h0
 */
typedef volatile union _AON_REG8X_FW_GENERAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_GENERAL_REG8X: 16;
        uint32_t FW_GENERAL_REG9X: 16;
    };
} AON_REG8X_FW_GENERAL_TYPE;

/* 0x414    0x4000_0414
    15:0    R/W FW_GENERAL_REG10X                       16'h0
    31:16   R/W FW_GENERAL_REG11X                       16'h0
 */
typedef volatile union _AON_REG10X_FW_GENERAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_GENERAL_REG10X: 16;
        uint32_t FW_GENERAL_REG11X: 16;
    };
} AON_REG10X_FW_GENERAL_TYPE;

