rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/aon_reg.h
/* 0xAB8    0x4000_0ab8
    0       R/W LOP_PON_BUCK_ENOCPS                     1'b1
    1       R/W LOP_PON_BUCK_POW_ZCD                    1'b1
    2       R/W LOP_PON_LDO_EN_DMYL_50U_LDODIGI         1'b0
    3       R/W LOP_PON_LDO_EN_DMYL_200U_LDODIGI        1'b0
    4       R/W LOP_PON_IB_500N_TONCOMP_EN              1'b1
    5       R/W LOP_PON_IB_500N_COTCOMP_EN              1'b1
    12:6    R/W LOP_PON_BUCK_ZCDOFFSET                  7'b0
    13      R/W LOP_PON_BUCK_POW_LowIq_ZCD              1'b0
    14      R/W LOP_PON_BUCK_STICKY_CODE_STATE1         1'b0
    15      R/W LOP_PON_BUCK_FORCE_CODE_STATE1          1'b0
    22:16   R   RSVD                                    7'b0
    23      R   RSVD                                    1'b0
    24      R/W LOP_PON_BUCK_STICKY_CODE_STATE2         1'b0
    25      R/W LOP_PON_BUCK_FORCE_CODE_STATE2          1'b0
    31:26   R/W LOP_PON_D300k_REG_MANU_CCOT             6'b001000
 */
typedef volatile union _AON_LOP_RG2X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_PON_BUCK_ENOCPS: 1;
        uint32_t LOP_PON_BUCK_POW_ZCD: 1;
        uint32_t LOP_PON_LDO_EN_DMYL_50U_LDODIGI: 1;
        uint32_t LOP_PON_LDO_EN_DMYL_200U_LDODIGI: 1;
        uint32_t LOP_PON_IB_500N_TONCOMP_EN: 1;
        uint32_t LOP_PON_IB_500N_COTCOMP_EN: 1;
        uint32_t LOP_PON_BUCK_ZCDOFFSET: 7;
        uint32_t LOP_PON_BUCK_POW_LowIq_ZCD: 1;
        uint32_t LOP_PON_BUCK_STICKY_CODE_STATE1: 1;
        uint32_t LOP_PON_BUCK_FORCE_CODE_STATE1: 1;
        uint32_t RSVD_1: 7;
        uint32_t RSVD: 1;
        uint32_t LOP_PON_BUCK_STICKY_CODE_STATE2: 1;
        uint32_t LOP_PON_BUCK_FORCE_CODE_STATE2: 1;
        uint32_t LOP_PON_D300k_REG_MANU_CCOT: 6;
    };
} AON_LOP_RG2X_TYPE;

/* 0xABC    0x4000_0abc
    0       R   RSVD                                    1'b0
    1       R/W LOP_POF_ENPC_DIGI                       1'b1
    2       R/W LOP_POF_POWLDO_DIGI                     1'b1
    3       R/W LOP_POF_ENPC_CORE                       1'b0
    4       R/W LOP_POF_POW_BIAS                        1'b0
    5       R/W LOP_POF_POW_32KOSC                      1'b1
    6       R/W LOP_POF_POW_32KXTAL                     1'b0
    8:7     R/W LOP_POF_SWR_CFG                         2'b0
    9       R/W LOP_POF_ENPC_AON                        1'b0
    15:10   R   RSVD                                    6'b0
    16      R/W LOP_POF_VDDIO_PSRAM_PC_EN               1'b1
    17      R/W LOP_POF_VDDIO_FLASH_PC_EN               1'b1
    18      R/W LOP_POF_XTAL                            1'b0
    19      R/W LOP_POF_AON_GATED_EN                    1'b0
    20      R/W LOP_POF_CAL                             1'b1
    23:21   R   RSVD                                    3'b0
    26:24   R/W LOP_POF_XTAL_MODE                       3'b100
    31:27   R   RSVD                                    5'b0
 */
typedef volatile union _AON_LOP_RG3X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD_3: 1;
        uint32_t LOP_POF_ENPC_DIGI: 1;
        uint32_t LOP_POF_POWLDO_DIGI: 1;
        uint32_t LOP_POF_ENPC_CORE: 1;
        uint32_t LOP_POF_POW_BIAS: 1;
        uint32_t LOP_POF_POW_32KOSC: 1;
        uint32_t LOP_POF_POW_32KXTAL: 1;
        uint32_t LOP_POF_SWR_CFG: 2;
        uint32_t LOP_POF_ENPC_AON: 1;
        uint32_t RSVD_2: 6;
        uint32_t LOP_POF_VDDIO_PSRAM_PC_EN: 1;
        uint32_t LOP_POF_VDDIO_FLASH_PC_EN: 1;
        uint32_t LOP_POF_XTAL: 1;
        uint32_t LOP_POF_AON_GATED_EN: 1;
        uint32_t LOP_POF_CAL: 1;
        uint32_t RSVD_1: 3;
        uint32_t LOP_POF_XTAL_MODE: 3;
        uint32_t RSVD: 5;
    };
} AON_LOP_RG3X_TYPE;

/* 0xAC0    0x4000_0ac0
    0       R/W LOP_POF_BUCK_PFM_IHALF                  1'b1
    1       R/W LOP_POF_BUCK_EN_OCP_IBON                1'b0
    5:2     R/W LOP_POF_BUCK_PFM_ICOMP                  4'b0010
    9:6     R/W LOP_POF_BUCK_PFM_ISCH                   4'b0010
    10      R/W LOP_POF_BUCK_ENOCPPS_H                  1'b1
    11      R/W LOP_POF_LDO_ENLDO311_IB20nA             1'b1
    14:12   R   RSVD                                    3'b0
    15      R/W LOP_POF_BUCK_ENOCPPFM_H                 1'b1
    18:16   R/W LOP_POF_LDO_EN_DL_LDO311                3'b111
    20:19   R/W LOP_POF_BUCK_OCPRES_H                   2'b01
    21      R/W LOP_POF_BUCK_OCPSEL_H                   1'b1
    24:22   R/W LOP_POF_BUCK_VREFOCP_H                  3'b110
    25      R/W LOP_POF_BUCK_ENOFFSAWPFM_H              1'b1
    26      R/W LOP_POF_BUCK_PFM_COT_EN                 1'b0
    27      R/W LOP_POF_BUCK_PFM_AOT_EN                 1'b0
    29:28   R/W LOP_POF_IBSEL_TONCOMP                   2'b00
    30      R/W LOP_POF_MBIAS_POW_EBIAS_AUXADC          1'b1
    31      R/W LOP_POF_AON_BUCK_LOW_IQ_ZCD_32K_CLK_EN  1'b1
 */
typedef volatile union _AON_LOP_RG4X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_POF_BUCK_PFM_IHALF: 1;
        uint32_t LOP_POF_BUCK_EN_OCP_IBON: 1;
        uint32_t LOP_POF_BUCK_PFM_ICOMP: 4;
        uint32_t LOP_POF_BUCK_PFM_ISCH: 4;
        uint32_t LOP_POF_BUCK_ENOCPPS_H: 1;
        uint32_t LOP_POF_LDO_ENLDO311_IB20nA: 1;
        uint32_t RSVD: 3;
        uint32_t LOP_POF_BUCK_ENOCPPFM_H: 1;
        uint32_t LOP_POF_LDO_EN_DL_LDO311: 3;
        uint32_t LOP_POF_BUCK_OCPRES_H: 2;
        uint32_t LOP_POF_BUCK_OCPSEL_H: 1;
        uint32_t LOP_POF_BUCK_VREFOCP_H: 3;
        uint32_t LOP_POF_BUCK_ENOFFSAWPFM_H: 1;
        uint32_t LOP_POF_BUCK_PFM_COT_EN: 1;
        uint32_t LOP_POF_BUCK_PFM_AOT_EN: 1;
        uint32_t LOP_POF_IBSEL_TONCOMP: 2;
        uint32_t LOP_POF_MBIAS_POW_EBIAS_AUXADC: 1;
        uint32_t LOP_POF_AON_BUCK_LOW_IQ_ZCD_32K_CLK_EN: 1;
    };
} AON_LOP_RG4X_TYPE;

/* 0xAC4    0x4000_0ac4
    0       R/W LOP_POF_BUCK_ENOCPS                     1'b1
    1       R/W LOP_POF_BUCK_POW_ZCD                    1'b1
    2       R/W LOP_POF_LDO_EN_DMYL_50U_LDODIGI         1'b0
    3       R/W LOP_POF_LDO_EN_DMYL_200U_LDODIGI        1'b0
    4       R/W LOP_POF_IB_500N_TONCOMP_EN              1'b0
    5       R/W LOP_POF_IB_500N_COTCOMP_EN              1'b0
    12:6    R/W LOP_POF_BUCK_ZCDOFFSET                  7'b0
    13      R/W LOP_POF_BUCK_POW_LowIq_ZCD              1'b0
    14      R/W LOP_POF_BUCK_STICKY_CODE_STATE1         1'b0
    15      R/W LOP_POF_BUCK_FORCE_CODE_STATE1          1'b0
    22:16   R   RSVD                                    7'b0
    23      R   RSVD                                    1'b0
    24      R/W LOP_POF_BUCK_STICKY_CODE_STATE2         1'b0
    25      R/W LOP_POF_BUCK_FORCE_CODE_STATE2          1'b0
    31:26   R/W LOP_POF_D300k_REG_MANU_CCOT             6'b001000
 */
typedef volatile union _AON_LOP_RG5X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_POF_BUCK_ENOCPS: 1;
        uint32_t LOP_POF_BUCK_POW_ZCD: 1;
        uint32_t LOP_POF_LDO_EN_DMYL_50U_LDODIGI: 1;
        uint32_t LOP_POF_LDO_EN_DMYL_200U_LDODIGI: 1;
        uint32_t LOP_POF_IB_500N_TONCOMP_EN: 1;
        uint32_t LOP_POF_IB_500N_COTCOMP_EN: 1;
        uint32_t LOP_POF_BUCK_ZCDOFFSET: 7;
        uint32_t LOP_POF_BUCK_POW_LowIq_ZCD: 1;
        uint32_t LOP_POF_BUCK_STICKY_CODE_STATE1: 1;
        uint32_t LOP_POF_BUCK_FORCE_CODE_STATE1: 1;
        uint32_t RSVD_1: 7;
        uint32_t RSVD: 1;
        uint32_t LOP_POF_BUCK_STICKY_CODE_STATE2: 1;
        uint32_t LOP_POF_BUCK_FORCE_CODE_STATE2: 1;
        uint32_t LOP_POF_D300k_REG_MANU_CCOT: 6;
    };
} AON_LOP_RG5X_TYPE;

/* 0xAC8    0x4000_0ac8
    0       R/W LOP_LPS_TIMER_WAKEUP                    1'b0
    1       R/W LOP_RFC_RET                             1'b0
    2       R/W LOP_MODEM_RET                           1'b0
    3       R/W LOP_BZ_RET                              1'b0
    4       R/W LOP_BLE_RET                             1'b0
    5       R/W LOP_PF_RET                              1'b0
    6       R/W LOP_DP_MODEM_RET                        1'b0
    7       R/W LOP_ZB_RET                              1'b0
    31:8    R   RSVD                                    24'h0
 */
typedef volatile union _AON_LOP_RG6X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_LPS_TIMER_WAKEUP: 1;
        uint32_t LOP_RFC_RET: 1;
        uint32_t LOP_MODEM_RET: 1;
        uint32_t LOP_BZ_RET: 1;
        uint32_t LOP_BLE_RET: 1;
        uint32_t LOP_PF_RET: 1;
        uint32_t LOP_DP_MODEM_RET: 1;
        uint32_t LOP_ZB_RET: 1;
        uint32_t RSVD: 24;
    };
} AON_LOP_RG6X_TYPE;

/* 0xACC    0x4000_0acc
    5:0     R/W LOP_BIAS_delay                          6'h30
    11:6    R/W LOP_LDO_delay                           6'h30
    15:12   R/W LOP_PLL_delay                           4'h3
    23:16   R/W LOP_SWR_delay                           8'hc0
    31:24   R/W LOP_XTAL_delay                          8'hc0
 */
typedef volatile union _AON_LOP_RG7X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_BIAS_delay: 6;
        uint32_t LOP_LDO_delay: 6;
        uint32_t LOP_PLL_delay: 4;
        uint32_t LOP_SWR_delay: 8;
        uint32_t LOP_XTAL_delay: 8;
    };
} AON_LOP_RG7X_TYPE;

/* 0xAD0    0x4000_0ad0
    5:0     R/W LOP_ENPC_CORE_BIG_delay                 6'h20
    11:6    R/W LOP_ENPC_CORE_SMALL_delay               6'h20
    15:12   R/W LOP_RG8X_Dummy_0                        4'h3
    23:16   R/W LOP_VDDIO_PC_VG2_delay                  8'hc0
    31:24   R/W LOP_VDDIO_PC_VG1_delay                  8'hc0
 */
typedef volatile union _AON_LOP_RG8X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_ENPC_CORE_BIG_delay: 6;
        uint32_t LOP_ENPC_CORE_SMALL_delay: 6;
        uint32_t LOP_RG8X_Dummy_0: 4;
        uint32_t LOP_VDDIO_PC_VG2_delay: 8;
        uint32_t LOP_VDDIO_PC_VG1_delay: 8;
    };
} AON_LOP_RG8X_TYPE;

/* 0xAD4    0x4000_0ad4
    4:0     R/W LOP_PON_VDIGI_TUNE_STATE1               5'b10000
    9:5     R/W LOP_PON_VDIGI_TUNE_STATE2               5'b10100
    14:10   R/W LOP_PON_VDIGI_TUNE_STATE3               5'b10100
    15      R   RSVD                                    1'b0
    31:16   R   RSVD                                    16'h0
 */
typedef volatile union _AON_LOP_RG9X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_PON_VDIGI_TUNE_STATE1: 5;
        uint32_t LOP_PON_VDIGI_TUNE_STATE2: 5;
        uint32_t LOP_PON_VDIGI_TUNE_STATE3: 5;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 16;
    };
} AON_LOP_RG9X_TYPE;

/* 0xAD8    0x4000_0ad8
    4:0     R/W LOP_POF_VDIGI_TUNE_STATE1               5'b10100
    9:5     R/W LOP_POF_VDIGI_TUNE_STATE2               5'b10000
    12:10   R/W LOP_POF_MBIAS_VR_SEL_LDO311_STATE1      3'b101
    15:13   R/W LOP_POF_MBIAS_VR_SEL_LDO311_STATE2      3'b010
    20:16   R/W LOP_VAON2VPON_PC_OFF_delay              5'h0f
    31:21   R   RSVD                                    11'h0
 */
typedef volatile union _AON_LOP_RG10X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_POF_VDIGI_TUNE_STATE1: 5;
        uint32_t LOP_POF_VDIGI_TUNE_STATE2: 5;
        uint32_t LOP_POF_MBIAS_VR_SEL_LDO311_STATE1: 3;
        uint32_t LOP_POF_MBIAS_VR_SEL_LDO311_STATE2: 3;
        uint32_t LOP_VAON2VPON_PC_OFF_delay: 5;
        uint32_t RSVD: 11;
    };
} AON_LOP_RG10X_TYPE;

/* 0xC00    0x4000_0c00
    5:0     R   MBIAS_REG0X_SD_TUNE_RO                  6'b0
    15:6    R/W MBIAS_REG0X_DUMMY1                      10'b1010101010
    18:16   R/W MBIAS_LPBG_VR1200                       3'b100
    21:19   R/W MBIAS_LPBG_R2                           3'b100
    24:22   R/W MBIAS_BG_BG_R1                          3'b100
    25      R/W MBIAS_POW_EBIAS_AUXADC                  1'b1
    28:26   R/W MBIAS_VR_SEL_LDO311                     3'b010
    30:29   R/W MBIAS_REG1X_DUMMY2                      2'b0
    31      R/W MBIAS_REG1X_DUMMY1                      1'b1
 */
typedef volatile union _AON_REG0X_MBIAS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t MBIAS_REG0X_SD_TUNE_RO: 6;
        uint32_t MBIAS_REG0X_DUMMY1: 10;
        uint32_t MBIAS_LPBG_VR1200: 3;
        uint32_t MBIAS_LPBG_R2: 3;
        uint32_t MBIAS_BG_BG_R1: 3;
        uint32_t MBIAS_POW_EBIAS_AUXADC: 1;
        uint32_t MBIAS_VR_SEL_LDO311: 3;
        uint32_t MBIAS_REG1X_DUMMY2: 2;
        uint32_t MBIAS_REG1X_DUMMY1: 1;
    };
} AON_REG0X_MBIAS_TYPE;

