rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/aon_reg.h
/* 0xCB0    0x4000_0cb0
    2:0     R/W XTAL_LPS_CKMODE                         3'b110
    5:3     R   AON2PON_XTAL_LDO                        3'b011
    8:6     R   AON2PON_XTAL_LDO_OK                     3'b011
    11:9    R/W XTAL_LPM_CKO_SEL                        3'b011
    14:12   R   AON2PON_XTAL_SEL_TOK                    3'b101
    15      R/W XTAL_reg_fast_settling                  1'b1
    23:16   R/W XTAL_SC_XI                              8'b00111111
    31:24   R/W XTAL_SC_XI_LP                           8'b11111111
 */
typedef volatile union _AON_BT_ANAPAR_XTAL6_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_LPS_CKMODE: 3;
        uint32_t AON2PON_XTAL_LDO: 3;
        uint32_t AON2PON_XTAL_LDO_OK: 3;
        uint32_t XTAL_LPM_CKO_SEL: 3;
        uint32_t AON2PON_XTAL_SEL_TOK: 3;
        uint32_t XTAL_reg_fast_settling: 1;
        uint32_t XTAL_SC_XI: 8;
        uint32_t XTAL_SC_XI_LP: 8;
    };
} AON_BT_ANAPAR_XTAL6_TYPE;

/* 0xCB4    0x4000_0cb4
    7:0     R   AON2PON_XTAL_SC_XI_OK0                  8'b11110000
    15:8    R/W XTAL_SC_XO                              8'b00111111
    23:16   R/W XTAL_SC_XO_LP                           8'b11111111
    31:24   R   AON2PON_XTAL_SC_XO_OK0                  8'b11110000
 */
typedef volatile union _AON_BT_ANAPAR_XTAL8_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t AON2PON_XTAL_SC_XI_OK0: 8;
        uint32_t XTAL_SC_XO: 8;
        uint32_t XTAL_SC_XO_LP: 8;
        uint32_t AON2PON_XTAL_SC_XO_OK0: 8;
    };
} AON_BT_ANAPAR_XTAL8_TYPE;

/* 0xCB8    0x4000_0cb8
    2:0     R/W XTAL_XORES_SEL                          3'b000
    4:3     R/W XTAL_reg_stp                            2'b00
    8:5     R/W XTAL_reg_dout_offset                    4'b0011
    9       R/W XTAL_GATED_LPMODE                       1'b0
    10      R/W XTAL_GATED_EN_PEAKDET_LP                1'b0
    11      R/W XTAL_LDOPC_SEL                          1'b0
    12      R   AON2PON_XTAL_BUF_LPS_SEL                1'b0
    13      R/W XTAL_LPMODE_CLK_SEL                     1'b0
    14      R/W XTAL_reg_fast_always_on                 1'b0
    15      R/W XTAL_LPMODE_CLK_AON                     1'b0
    16      R/W XTAL_IOP_SEL                            1'b0
    17      R/W XTAL_EN_XTAL_PDCK_LP                    1'b0
    20:18   R/W XTAL_LDO_SW_LP                          3'b000
    25:21   R/W BT_ANAPAR_XTAL11_DUMMY                  5'b10000
    26      R/W XTAL_PDC_MANUAL                         1'b0
    27      R/W XTAL_PKDET_CMP_SWAP                     1'b0
    28      R/W XTAL_PKDET_LOAD_SWAP                    1'b0
    31:29   R   AON2PON_XTAL_SEL_TOK01                  3'b100
 */
typedef volatile union _AON_BT_ANAPAR_XTAL10_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_XORES_SEL: 3;
        uint32_t XTAL_reg_stp: 2;
        uint32_t XTAL_reg_dout_offset: 4;
        uint32_t XTAL_GATED_LPMODE: 1;
        uint32_t XTAL_GATED_EN_PEAKDET_LP: 1;
        uint32_t XTAL_LDOPC_SEL: 1;
        uint32_t AON2PON_XTAL_BUF_LPS_SEL: 1;
        uint32_t XTAL_LPMODE_CLK_SEL: 1;
        uint32_t XTAL_reg_fast_always_on: 1;
        uint32_t XTAL_LPMODE_CLK_AON: 1;
        uint32_t XTAL_IOP_SEL: 1;
        uint32_t XTAL_EN_XTAL_PDCK_LP: 1;
        uint32_t XTAL_LDO_SW_LP: 3;
        uint32_t BT_ANAPAR_XTAL11_DUMMY: 5;
        uint32_t XTAL_PDC_MANUAL: 1;
        uint32_t XTAL_PKDET_CMP_SWAP: 1;
        uint32_t XTAL_PKDET_LOAD_SWAP: 1;
        uint32_t AON2PON_XTAL_SEL_TOK01: 3;
    };
} AON_BT_ANAPAR_XTAL10_TYPE;

/* 0xCBC    0x4000_0cbc
    3:0     R/W XTAL_LPSCLK_CNTRL                       4'b0000
    4       R   AON2PON_XTAL_EN_XTAL_SEL_TOK01          1'b0
    5       R   AON2PON_XTAL_EN_XO_CLK_SW               1'b0
    6       R/W XTAL_FASTSET_MANU                       1'b0
    8:7     R/W XTAL_OV_RATIO                           2'b01
    11:9    R/W XTAL_OV_UNIT                            3'b010
    12      R/W XTAL_LPS_CAP_CTRL                       1'b1
    14:13   R/W XTAL_LPS_CAP_CYC                        2'b00
    15      R/W XTAL_MD_LPOW                            1'b0
    21:16   R/W XTAL_WAIT_CYC                           6'b000010
    23:22   R/W XTAL_LPS_CAP_STEP                       2'b01
    24      R/W XTAL_BYPASS_CTRL                        1'b0
    27:25   R/W XTAL_RDY_SEL_TOK                        3'b100
    31:28   R/W XTAL_CTRL_OUT_SEL                       4'b0000
 */
typedef volatile union _AON_BT_ANAPAR_XTAL12_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_LPSCLK_CNTRL: 4;
        uint32_t AON2PON_XTAL_EN_XTAL_SEL_TOK01: 1;
        uint32_t AON2PON_XTAL_EN_XO_CLK_SW: 1;
        uint32_t XTAL_FASTSET_MANU: 1;
        uint32_t XTAL_OV_RATIO: 2;
        uint32_t XTAL_OV_UNIT: 3;
        uint32_t XTAL_LPS_CAP_CTRL: 1;
        uint32_t XTAL_LPS_CAP_CYC: 2;
        uint32_t XTAL_MD_LPOW: 1;
        uint32_t XTAL_WAIT_CYC: 6;
        uint32_t XTAL_LPS_CAP_STEP: 2;
        uint32_t XTAL_BYPASS_CTRL: 1;
        uint32_t XTAL_RDY_SEL_TOK: 3;
        uint32_t XTAL_CTRL_OUT_SEL: 4;
    };
} AON_BT_ANAPAR_XTAL12_TYPE;

/* 0xCC0    0x4000_0cc0
    0       R/W BT_ANAPAR_XTAL14_DUMMY0                 1'b0
    2:1     R/W XTAL_MODE_DLY                           2'b10
    15:3    R/W BT_ANAPAR_XTAL14_DUMMY3                 13'h0
    21:16   R/W XTAL_PDC_LP                             6'b100000
    31:22   R/W BT_ANAPAR_XTAL15_DUMMY                  10'b0000000000
 */
typedef volatile union _AON_BT_ANAPAR_XTAL14_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BT_ANAPAR_XTAL14_DUMMY0: 1;
        uint32_t XTAL_MODE_DLY: 2;
        uint32_t BT_ANAPAR_XTAL14_DUMMY3: 13;
        uint32_t XTAL_PDC_LP: 6;
        uint32_t BT_ANAPAR_XTAL15_DUMMY: 10;
    };
} AON_BT_ANAPAR_XTAL14_TYPE;

/* 0xCC4    0x4000_0cc4
    15:0    R/W BT_ANAPAR_XTAL16_DUMMY                  16'b0
    31:16   R/W BT_ANAPAR_XTAL17_DUMMY                  16'hffff
 */
typedef volatile union _AON_BT_ANAPAR_XTAL16_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BT_ANAPAR_XTAL16_DUMMY: 16;
        uint32_t BT_ANAPAR_XTAL17_DUMMY: 16;
    };
} AON_BT_ANAPAR_XTAL16_TYPE;

/* 0xCC8    0x4000_0cc8
    2:0     R   RSVD                                    3'b0
    3       R/W AAC_SEL                                 1'b0
    9:4     R/W AAC_GM1                                 6'h1f
    15:10   R   AON2PON_XTAL_GM_AAC                     6'h0f
    23:16   R/W CLK_REQ_XTAL_SC_XI                      8'b00111111
    31:24   R/W CLK_REQ_XTAL_SC_XO                      8'b00111111
 */
typedef volatile union _AON_REG0X_XTAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD: 3;
        uint32_t AAC_SEL: 1;
        uint32_t AAC_GM1: 6;
        uint32_t AON2PON_XTAL_GM_AAC: 6;
        uint32_t CLK_REQ_XTAL_SC_XI: 8;
        uint32_t CLK_REQ_XTAL_SC_XO: 8;
    };
} AON_REG0X_XTAL_TYPE;

/* 0xCCC    0x4000_0ccc
    7:0     R   XTAL_IS_FINEO                           8'b11111111
    8       R   XTAL_CLK_OK                             1'b0
    9       R   XTAL_CLK_CHANGE_OK                      1'b0
    10      R   XTAL_NM_MODE_O                          1'b0
    11      R   XTAL_MODE_READY_O                       1'b0
    14:12   R   XTAL_MODE_O                             3'b0
    15      R   XTAL_LPS_MODE_O                         1'b0
    16      R   XTAL_HP_MODE_O                          1'b0
    17      R   XTAL_FASTSET_O                          1'b0
    23:18   R   RSVD                                    6'b0
    31:24   R   XTAL_CTRL_DEBUG_OUT                     8'b0
 */
typedef volatile union _AON_REG1X_XTAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_IS_FINEO: 8;
        uint32_t XTAL_CLK_OK: 1;
        uint32_t XTAL_CLK_CHANGE_OK: 1;
        uint32_t XTAL_NM_MODE_O: 1;
        uint32_t XTAL_MODE_READY_O: 1;
        uint32_t XTAL_MODE_O: 3;
        uint32_t XTAL_LPS_MODE_O: 1;
        uint32_t XTAL_HP_MODE_O: 1;
        uint32_t XTAL_FASTSET_O: 1;
        uint32_t RSVD: 6;
        uint32_t XTAL_CTRL_DEBUG_OUT: 8;
    };
} AON_REG1X_XTAL_TYPE;

/* 0xCD0    0x4000_0cd0
    0       R/W ADDA_SW_LDO2PWRCUT                      1'b0
    1       R/W ADDA_POW_LDO_VREF                       1'b1
    2       R/W ADDA_POW_LDO_OP                         1'b1
    3       R/W ADDA_LDO_VPULSE                         1'b0
    7:4     R/W ADDA_LDO_SW                             4'b0010
    8       R/W ADDA_DOUBLE_OP_I                        1'b0
    15:9    R   RSVD                                    7'b0
    31:16   R   RSVD                                    16'b0
 */
typedef volatile union _AON_REG0X_BT_ANAPAR_LDO_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ADDA_SW_LDO2PWRCUT: 1;
        uint32_t ADDA_POW_LDO_VREF: 1;
        uint32_t ADDA_POW_LDO_OP: 1;
        uint32_t ADDA_LDO_VPULSE: 1;
        uint32_t ADDA_LDO_SW: 4;
        uint32_t ADDA_DOUBLE_OP_I: 1;
        uint32_t RSVD_1: 7;
        uint32_t RSVD: 16;
    };
} AON_REG0X_BT_ANAPAR_LDO_TYPE;

