rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/aon_reg.h
/* 0xCD4    0x4000_0cd4
    0       R/W SW_LDO2PWRCUT                           1'b0
    1       R/W POW_LDO                                 1'b0
    2       R/W EN_SW                                   1'b0
    5:3     R/W LDO_SW                                  3'b100
    15:6    R   RSVD                                    10'b0
    31:16   R   RSVD                                    16'b0
 */
typedef volatile union _AON_REG0X_RF_LDO318_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SW_LDO2PWRCUT: 1;
        uint32_t POW_LDO: 1;
        uint32_t EN_SW: 1;
        uint32_t LDO_SW: 3;
        uint32_t RSVD_1: 10;
        uint32_t RSVD: 16;
    };
} AON_REG0X_RF_LDO318_TYPE;

/* 0xD00    0x4000_0d00
    8:0     R/W REG0X_LDO_PLL1_DUMMY                    9'b0
    9       R/W DOUBLE_OP_I                             1'b0
    10      R/W PLL_SW_LDO2PWRCUT                       1'b0
    11      R/W POW_LDO_OP                              1'b0
    12      R/W PLL_LDO_VPULSE                          1'b0
    15:13   R/W PLL_LDO_SW                              3'b010
    31:16   R   RSVD                                    16'b0
 */
typedef volatile union _AON_REG0X_LDO_PLL1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG0X_LDO_PLL1_DUMMY: 9;
        uint32_t DOUBLE_OP_I: 1;
        uint32_t PLL_SW_LDO2PWRCUT: 1;
        uint32_t POW_LDO_OP: 1;
        uint32_t PLL_LDO_VPULSE: 1;
        uint32_t PLL_LDO_SW: 3;
        uint32_t RSVD: 16;
    };
} AON_REG0X_LDO_PLL1_TYPE;

/* 0xD40    0x4000_0d40
    23:0    R   RSVD                                    24'h0
    24      R/W REG0X_USB_DUMMY0                        1'b0
    25      R/W UA33PC_EN                               1'b0
    26      R/W UA11PC_EN                               1'b0
    27      R/W UD11PC_EN                               1'b0
    28      R/W USB_POW_BG                              1'b0
    29      R/W USB_POW_BC_L                            1'b0
    30      R/W ISO_LV                                  1'b1
    31      R/W ISO_UA2USB                              1'b1
 */
typedef volatile union _AON_REG_USB_POWER_CTL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD: 24;
        uint32_t REG0X_USB_DUMMY0: 1;
        uint32_t UA33PC_EN: 1;
        uint32_t UA11PC_EN: 1;
        uint32_t UD11PC_EN: 1;
        uint32_t USB_POW_BG: 1;
        uint32_t USB_POW_BC_L: 1;
        uint32_t ISO_LV: 1;
        uint32_t ISO_UA2USB: 1;
    };
} AON_REG_USB_POWER_CTL_TYPE;

/* 0xD44    0x4000_0d44
    0       R/W r_usb_clk_src_en                        1'h0
    4:1     R/W r_usb_div_sel                           4'h0
    5       R/W r_usb_div_en                            1'h0
    6       R/W r_usb_mux_clk_cg_en                     1'h0
    7       R/W r_usb_clk_src_sel1                      1'h0
    8       R/W r_usb_clk_src_sel0                      1'h0
    20:9    R/W iso_int_out_en                          12'h0
    26:21   R   RSVD                                    6'h0
    27      R/W usb_func_en                             1'h0
    28      R/W usb_ck_en                               1'h0
    31:29   R   RSVD                                    3'h0
 */
typedef volatile union _AON_REG_USB_CLK_CTL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_usb_clk_src_en: 1;
        uint32_t r_usb_div_sel: 4;
        uint32_t r_usb_div_en: 1;
        uint32_t r_usb_mux_clk_cg_en: 1;
        uint32_t r_usb_clk_src_sel1: 1;
        uint32_t r_usb_clk_src_sel0: 1;
        uint32_t iso_int_out_en: 12;
        uint32_t RSVD_1: 6;
        uint32_t usb_func_en: 1;
        uint32_t usb_ck_en: 1;
        uint32_t RSVD: 3;
    };
} AON_REG_USB_CLK_CTL_TYPE;

/* 0xD60    0x4000_0d60
    0       R/W POW_XTAL                                1'b0
    3:1     R/W XTAL_MODE                               3'b100
    4       R/W ISO_XTAL_MODE_CTRL                      1'b1
    7:5     R/W XTAL_LDO                                3'b011
    10:8    R/W XTAL_LDO_OK                             3'b011
    13:11   R/W XTAL_SEL_TOK                            3'b101
    21:14   R/W XTAL_SC_XI_OK0                          8'b11110000
    29:22   R/W XTAL_SC_XO_OK0                          8'b11110000
    31:30   R   RSVD                                    2'b0
 */
typedef volatile union _AON_REG_XTAL0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t POW_XTAL: 1;
        uint32_t XTAL_MODE: 3;
        uint32_t ISO_XTAL_MODE_CTRL: 1;
        uint32_t XTAL_LDO: 3;
        uint32_t XTAL_LDO_OK: 3;
        uint32_t XTAL_SEL_TOK: 3;
        uint32_t XTAL_SC_XI_OK0: 8;
        uint32_t XTAL_SC_XO_OK0: 8;
        uint32_t RSVD: 2;
    };
} AON_REG_XTAL0_TYPE;

/* 0xD64    0x4000_0d64
    0       R/W XTAL_BUF_LPS_SEL                        1'b0
    3:1     R/W XTAL_SEL_TOK01                          3'b100
    4       R/W XTAL_EN_XTAL_SEL_TOK01                  1'b0
    5       R/W XTAL_EN_XO_CLK_SW                       1'b0
    11:6    R/W XTAL_GM_AAC                             6'h0f
    31:12   R   RSVD                                    20'b0
 */
typedef volatile union _AON_REG_XTAL1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_BUF_LPS_SEL: 1;
        uint32_t XTAL_SEL_TOK01: 3;
        uint32_t XTAL_EN_XTAL_SEL_TOK01: 1;
        uint32_t XTAL_EN_XO_CLK_SW: 1;
        uint32_t XTAL_GM_AAC: 6;
        uint32_t RSVD: 20;
    };
} AON_REG_XTAL1_TYPE;

/* 0xD80    0x4000_0d80
    9:0     R/W REG0X_PLL1_dummy                        10'b0
    15:10   R/W DIV<5:0>                                6'b010111
    31:16   R   RSVD                                    16'b0
 */
typedef volatile union _AON_REG0X_PLL1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG0X_PLL1_dummy: 10;
        uint32_t DIV_5_0: 6;
        uint32_t RSVD: 16;
    };
} AON_REG0X_PLL1_TYPE;

/* 0xD84    0x4000_0d84
    0       R/W REG2X_PLL1_dummy                        1'b0
    2:1     R/W debugout_sel<1:0>                       2'b00
    3       R/W debugout_en                             1'b0
    5:4     R/W reg_ck_out_peri_sel<1:0>                2'b00
    6       R/W reg_ck_out_peri_div5                    1'b0
    8:7     R/W reg_ck_out_mac_sel<1:0>                 2'b00
    9       R/W reg_ck_out_mac_div5                     1'b0
    10      R/W reg_CKO_CPU_en                          1'b0
    11      R/W reg_CKO_PERI_en                         1'b0
    12      R/W reg_CKO_MAC50M_en                       1'b0
    13      R/W reg_CKO_MAC_en                          1'b0
    15:14   R/W VC_THL<1:0>                             2'b00
    18:16   R/W r3_set<2:0>                             3'b000
    19      R/W c3_set                                  1'b0
    22:20   R/W rs_set<2:0>                             3'b100
    24:23   R/W cs_set<1:0>                             2'b10
    26:25   R/W cp_set<1:0>                             2'b01
    27      R/W reg_ck_frefpn_sel                       1'b1
    28      R/W pow_cpop                                1'b1
    29      R/W dogenb                                  1'b0
    30      R/W fref_edge                               1'b0
    31      R/W pow_pll                                 1'b0
 */
typedef volatile union _AON_REG2X_PLL1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG2X_PLL1_dummy: 1;
        uint32_t debugout_sel_1_0: 2;
        uint32_t debugout_en: 1;
        uint32_t reg_ck_out_peri_sel_1_0: 2;
        uint32_t reg_ck_out_peri_div5: 1;
        uint32_t reg_ck_out_mac_sel_1_0: 2;
        uint32_t reg_ck_out_mac_div5: 1;
        uint32_t reg_CKO_CPU_en: 1;
        uint32_t reg_CKO_PERI_en: 1;
        uint32_t reg_CKO_MAC50M_en: 1;
        uint32_t reg_CKO_MAC_en: 1;
        uint32_t VC_THL_1_0: 2;
        uint32_t r3_set_2_0: 3;
        uint32_t c3_set: 1;
        uint32_t rs_set_2_0: 3;
        uint32_t cs_set_1_0: 2;
        uint32_t cp_set_1_0: 2;
        uint32_t reg_ck_frefpn_sel: 1;
        uint32_t pow_cpop: 1;
        uint32_t dogenb: 1;
        uint32_t fref_edge: 1;
        uint32_t pow_pll: 1;
    };
} AON_REG2X_PLL1_TYPE;

