rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/aon_reg.h
/* 0x1928   0x4000_1928
    0       R/W PAD_P2_O[4]                     1'b0
    1       R/W PAD_P2_E[4]                     1'b0
    2       R/W PAD_P2_PU_EN[4]                 1'b1
    3       R/W AON_PAD_P2_PD[4]                1'b1
    4       R/W PAD_P2_PUPDC[4]                 1'b0
    5       R/W PAD_P2_WKEN[4]                  1'b0
    6       R/W PAD_P2_WKPOL[4]                 1'b0
    7       R/W PAD_P2_E2[4]                    1'b1
    8       R/W PAD_P2_SHDN[4]                  1'b1
    9       R/W PAD_P2_S[4]                     1'b0
    10      R/W PAD_P2_DEB[4]                   1'b0
    11      R   RSVD                            1'b0
    14:12   R/W PAD_P2_4_CFG                    3'h0
    15      R/W PAD_P2_O_EN[4]                  1'h1
    16      R/W PAD_P2_O[5]                     1'b0
    17      R/W PAD_P2_E[5]                     1'b0
    18      R/W PAD_P2_PU_EN[5]                 1'b1
    19      R/W AON_PAD_P2_PD[5]                1'b1
    20      R/W PAD_P2_PUPDC[5]                 1'b0
    21      R/W PAD_P2_WKEN[5]                  1'b0
    22      R/W PAD_P2_WKPOL[5]                 1'b0
    23      R/W PAD_P2_E2[5]                    1'b1
    24      R/W PAD_P2_SHDN[5]                  1'b1
    25      R/W PAD_P2_S[5]                     1'b0
    26      R/W PAD_P2_DEB[5]                   1'b0
    28:27   R   RSVD                            2'b0
    30:29   R/W PAD_P2_5_CFG                    2'h0
    31      R/W PAD_P2_O_EN[5]                  1'h1
 */
typedef volatile union _AON_NS_P2_4_P2_5_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P2_O_4: 1;
        uint32_t PAD_P2_E_4: 1;
        uint32_t PAD_P2_PU_EN_4: 1;
        uint32_t AON_PAD_P2_PD_4: 1;
        uint32_t PAD_P2_PUPDC_4: 1;
        uint32_t PAD_P2_WKEN_4: 1;
        uint32_t PAD_P2_WKPOL_4: 1;
        uint32_t PAD_P2_E2_4: 1;
        uint32_t PAD_P2_SHDN_4: 1;
        uint32_t PAD_P2_S_4: 1;
        uint32_t PAD_P2_DEB_4: 1;
        uint32_t RSVD_1: 1;
        uint32_t PAD_P2_4_CFG: 3;
        uint32_t PAD_P2_O_EN_4: 1;
        uint32_t PAD_P2_O_5: 1;
        uint32_t PAD_P2_E_5: 1;
        uint32_t PAD_P2_PU_EN_5: 1;
        uint32_t AON_PAD_P2_PD_5: 1;
        uint32_t PAD_P2_PUPDC_5: 1;
        uint32_t PAD_P2_WKEN_5: 1;
        uint32_t PAD_P2_WKPOL_5: 1;
        uint32_t PAD_P2_E2_5: 1;
        uint32_t PAD_P2_SHDN_5: 1;
        uint32_t PAD_P2_S_5: 1;
        uint32_t PAD_P2_DEB_5: 1;
        uint32_t RSVD: 2;
        uint32_t PAD_P2_5_CFG: 2;
        uint32_t PAD_P2_O_EN_5: 1;
    };
} AON_NS_P2_4_P2_5_PAD_CFG_TYPE;

/* 0x192C   0x4000_192c
    0       R/W PAD_P2_O[6]                     1'b0
    1       R/W PAD_P2_E[6]                     1'b0
    2       R/W PAD_P2_PU_EN[6]                 1'b1
    3       R/W AON_PAD_P2_PD[6]                1'b1
    4       R/W PAD_P2_PUPDC[6]                 1'b0
    5       R/W PAD_P2_WKEN[6]                  1'b0
    6       R/W PAD_P2_WKPOL[6]                 1'b0
    7       R/W PAD_P2_E2[6]                    1'b1
    8       R/W PAD_P2_SHDN[6]                  1'b1
    9       R/W PAD_P2_S[6]                     1'b0
    10      R/W PAD_P2_DEB[6]                   1'b0
    12:11   R   RSVD                            2'b0
    13      R/W PAD_P2_6_dbg_en                 1'b0
    14      R   RSVD                            1'h0
    15      R/W PAD_P2_O_EN[6]                  1'h1
    16      R/W PAD_P2_O[7]                     1'b0
    17      R/W PAD_P2_E[7]                     1'b0
    18      R/W PAD_P2_PU_EN[7]                 1'b1
    19      R/W AON_PAD_P2_PD[7]                1'b1
    20      R/W PAD_P2_PUPDC[7]                 1'b0
    21      R/W PAD_P2_WKEN[7]                  1'b0
    22      R/W PAD_P2_WKPOL[7]                 1'b0
    23      R/W PAD_P2_E2[7]                    1'b1
    24      R/W PAD_P2_SHDN[7]                  1'b1
    25      R/W PAD_P2_S[7]                     1'b0
    26      R/W PAD_P2_DEB[7]                   1'b0
    28:27   R   RSVD                            2'b0
    29      R/W PAD_P2_7_dbg_en                 1'b0
    30      R   RSVD                            1'h0
    31      R/W PAD_P2_O_EN[7]                  1'h1
 */
typedef volatile union _AON_NS_P2_6_P2_7_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P2_O_6: 1;
        uint32_t PAD_P2_E_6: 1;
        uint32_t PAD_P2_PU_EN_6: 1;
        uint32_t AON_PAD_P2_PD_6: 1;
        uint32_t PAD_P2_PUPDC_6: 1;
        uint32_t PAD_P2_WKEN_6: 1;
        uint32_t PAD_P2_WKPOL_6: 1;
        uint32_t PAD_P2_E2_6: 1;
        uint32_t PAD_P2_SHDN_6: 1;
        uint32_t PAD_P2_S_6: 1;
        uint32_t PAD_P2_DEB_6: 1;
        uint32_t RSVD_3: 2;
        uint32_t PAD_P2_6_dbg_en: 1;
        uint32_t RSVD_2: 1;
        uint32_t PAD_P2_O_EN_6: 1;
        uint32_t PAD_P2_O_7: 1;
        uint32_t PAD_P2_E_7: 1;
        uint32_t PAD_P2_PU_EN_7: 1;
        uint32_t AON_PAD_P2_PD_7: 1;
        uint32_t PAD_P2_PUPDC_7: 1;
        uint32_t PAD_P2_WKEN_7: 1;
        uint32_t PAD_P2_WKPOL_7: 1;
        uint32_t PAD_P2_E2_7: 1;
        uint32_t PAD_P2_SHDN_7: 1;
        uint32_t PAD_P2_S_7: 1;
        uint32_t PAD_P2_DEB_7: 1;
        uint32_t RSVD_1: 2;
        uint32_t PAD_P2_7_dbg_en: 1;
        uint32_t RSVD: 1;
        uint32_t PAD_P2_O_EN_7: 1;
    };
} AON_NS_P2_6_P2_7_PAD_CFG_TYPE;

/* 0x1930   0x4000_1930
    0       R/W PAD_P3_O[0]                     1'b0
    1       R/W PAD_P3_E[0]                     1'b0
    2       R/W PAD_P3_PU_EN[0]                 1'b1
    3       R/W AON_PAD_P3_PD[0]                1'b0
    4       R/W PAD_P3_PUPDC[0]                 1'b0
    5       R/W PAD_P3_WKEN[0]                  1'b0
    6       R/W PAD_P3_WKPOL[0]                 1'b0
    7       R/W PAD_P3_E2[0]                    1'b1
    8       R/W PAD_P3_SHDN[0]                  1'b1
    9       R/W PAD_P3_S[0]                     1'b0
    10      R/W PAD_P3_DEB[0]                   1'b0
    14:11   R   RSVD                            4'b0
    15      R/W PAD_P3_O_EN[0]                  1'h1
    16      R/W PAD_P3_O[1]                     1'b0
    17      R/W PAD_P3_E[1]                     1'b0
    18      R/W PAD_P3_PU_EN[1]                 1'b1
    19      R/W AON_PAD_P3_PD[1]                1'b0
    20      R/W PAD_P3_PUPDC[1]                 1'b0
    21      R/W PAD_P3_WKEN[1]                  1'b0
    22      R/W PAD_P3_WKPOL[1]                 1'b0
    23      R/W PAD_P3_E2[1]                    1'b1
    24      R/W PAD_P3_SHDN[1]                  1'b1
    25      R/W PAD_P3_S[1]                     1'b0
    26      R/W PAD_P3_DEB[1]                   1'b0
    30:27   R   RSVD                            4'b0
    31      R/W PAD_P3_O_EN[1]                  1'h1
 */
typedef volatile union _AON_NS_P3_0_P3_1_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P3_O_0: 1;
        uint32_t PAD_P3_E_0: 1;
        uint32_t PAD_P3_PU_EN_0: 1;
        uint32_t AON_PAD_P3_PD_0: 1;
        uint32_t PAD_P3_PUPDC_0: 1;
        uint32_t PAD_P3_WKEN_0: 1;
        uint32_t PAD_P3_WKPOL_0: 1;
        uint32_t PAD_P3_E2_0: 1;
        uint32_t PAD_P3_SHDN_0: 1;
        uint32_t PAD_P3_S_0: 1;
        uint32_t PAD_P3_DEB_0: 1;
        uint32_t RSVD_1: 4;
        uint32_t PAD_P3_O_EN_0: 1;
        uint32_t PAD_P3_O_1: 1;
        uint32_t PAD_P3_E_1: 1;
        uint32_t PAD_P3_PU_EN_1: 1;
        uint32_t AON_PAD_P3_PD_1: 1;
        uint32_t PAD_P3_PUPDC_1: 1;
        uint32_t PAD_P3_WKEN_1: 1;
        uint32_t PAD_P3_WKPOL_1: 1;
        uint32_t PAD_P3_E2_1: 1;
        uint32_t PAD_P3_SHDN_1: 1;
        uint32_t PAD_P3_S_1: 1;
        uint32_t PAD_P3_DEB_1: 1;
        uint32_t RSVD: 4;
        uint32_t PAD_P3_O_EN_1: 1;
    };
} AON_NS_P3_0_P3_1_PAD_CFG_TYPE;

/* 0x1934   0x4000_1934
    0       R/W PAD_P3_O[2]                     1'b0
    1       R/W PAD_P3_E[2]                     1'b0
    2       R/W PAD_P3_PU_EN[2]                 1'b1
    3       R/W AON_PAD_P3_PD[2]                1'b1
    4       R/W PAD_P3_PUPDC[2]                 1'b0
    5       R/W PAD_P3_WKEN[2]                  1'b0
    6       R/W PAD_P3_WKPOL[2]                 1'b0
    7       R/W PAD_P3_E2[2]                    1'b1
    8       R/W PAD_P3_SHDN[2]                  1'b1
    9       R/W PAD_P3_S[2]                     1'b0
    10      R/W PAD_P3_DEB[2]                   1'b0
    11      R/W PAD_P3_HS_MUX[2]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P3_O_EN[2]                  1'h1
    16      R/W PAD_P3_O[3]                     1'b0
    17      R/W PAD_P3_E[3]                     1'b0
    18      R/W PAD_P3_PU_EN[3]                 1'b1
    19      R/W AON_PAD_P3_PD[3]                1'b1
    20      R/W PAD_P3_PUPDC[3]                 1'b0
    21      R/W PAD_P3_WKEN[3]                  1'b0
    22      R/W PAD_P3_WKPOL[3]                 1'b0
    23      R/W PAD_P3_E2[3]                    1'b1
    24      R/W PAD_P3_SHDN[3]                  1'b1
    25      R/W PAD_P3_S[3]                     1'b0
    26      R/W PAD_P3_DEB[3]                   1'b0
    27      R/W PAD_P3_HS_MUX[3]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P3_O_EN[3]                  1'h1
 */
typedef volatile union _AON_NS_P3_2_P3_3_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P3_O_2: 1;
        uint32_t PAD_P3_E_2: 1;
        uint32_t PAD_P3_PU_EN_2: 1;
        uint32_t AON_PAD_P3_PD_2: 1;
        uint32_t PAD_P3_PUPDC_2: 1;
        uint32_t PAD_P3_WKEN_2: 1;
        uint32_t PAD_P3_WKPOL_2: 1;
        uint32_t PAD_P3_E2_2: 1;
        uint32_t PAD_P3_SHDN_2: 1;
        uint32_t PAD_P3_S_2: 1;
        uint32_t PAD_P3_DEB_2: 1;
        uint32_t PAD_P3_HS_MUX_2: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P3_O_EN_2: 1;
        uint32_t PAD_P3_O_3: 1;
        uint32_t PAD_P3_E_3: 1;
        uint32_t PAD_P3_PU_EN_3: 1;
        uint32_t AON_PAD_P3_PD_3: 1;
        uint32_t PAD_P3_PUPDC_3: 1;
        uint32_t PAD_P3_WKEN_3: 1;
        uint32_t PAD_P3_WKPOL_3: 1;
        uint32_t PAD_P3_E2_3: 1;
        uint32_t PAD_P3_SHDN_3: 1;
        uint32_t PAD_P3_S_3: 1;
        uint32_t PAD_P3_DEB_3: 1;
        uint32_t PAD_P3_HS_MUX_3: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P3_O_EN_3: 1;
    };
} AON_NS_P3_2_P3_3_PAD_CFG_TYPE;

