rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/aon_reg.h
/* 0x194C   0x4000_194c
    0       R/W PAD_MICBIAS_O                   1'b0
    1       R/W PAD_MICBIAS_E                   1'b0
    2       R/W PAD_MICBIAS_PU_EN               1'b1
    3       R/W AON_PAD_MICBIAS_PD              1'b1
    4       R/W PAD_MICBIAS_PUPDC               1'b0
    5       R/W PAD_MICBIAS_WKEN                1'b0
    6       R/W PAD_MICBIAS_WKPOL               1'b0
    7       R/W PAD_MICBIAS_E2                  1'b1
    8       R/W PAD_MICBIAS_SHDN                1'b1
    9       R/W PAD_MICBIAS_S                   1'b0
    10      R/W PAD_MICBIAS_DEB                 1'b0
    12:11   R   RSVD                            2'b0
    13      R/W PAD_MICBIAS_dbg_en              1'b0
    14      R   RSVD                            1'h0
    15      R/W PAD_MICBIAS_O_EN                1'h1
    16      R   RSVD                            1'b0
    17      R   RSVD                            1'b0
    18      R   RSVD                            1'b1
    19      R   RSVD                            1'b1
    20      R   RSVD                            1'b0
    21      R   RSVD                            1'b0
    22      R   RSVD                            1'b0
    23      R   RSVD                            1'b0
    24      R   RSVD                            1'b1
    25      R   RSVD                            1'b0
    26      R   RSVD                            1'b0
    28:27   R   RSVD                            2'b0
    29      R   RSVD                            1'b0
    31:30   R   RSVD                            2'h0
 */
typedef volatile union _AON_NS_P_MICBIAS_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_MICBIAS_O: 1;
        uint32_t PAD_MICBIAS_E: 1;
        uint32_t PAD_MICBIAS_PU_EN: 1;
        uint32_t AON_PAD_MICBIAS_PD: 1;
        uint32_t PAD_MICBIAS_PUPDC: 1;
        uint32_t PAD_MICBIAS_WKEN: 1;
        uint32_t PAD_MICBIAS_WKPOL: 1;
        uint32_t PAD_MICBIAS_E2: 1;
        uint32_t PAD_MICBIAS_SHDN: 1;
        uint32_t PAD_MICBIAS_S: 1;
        uint32_t PAD_MICBIAS_DEB: 1;
        uint32_t RSVD_15: 2;
        uint32_t PAD_MICBIAS_dbg_en: 1;
        uint32_t RSVD_14: 1;
        uint32_t PAD_MICBIAS_O_EN: 1;
        uint32_t RSVD_13: 1;
        uint32_t RSVD_12: 1;
        uint32_t RSVD_11: 1;
        uint32_t RSVD_10: 1;
        uint32_t RSVD_9: 1;
        uint32_t RSVD_8: 1;
        uint32_t RSVD_7: 1;
        uint32_t RSVD_6: 1;
        uint32_t RSVD_5: 1;
        uint32_t RSVD_4: 1;
        uint32_t RSVD_3: 1;
        uint32_t RSVD_2: 2;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 2;
    };
} AON_NS_P_MICBIAS_PAD_CFG_TYPE;

/* 0x1950   0x4000_1950
    0       R/W TOP_PAD_SMT                     1'b0
    1       R/W BOT_PAD_SMT                     1'b0
    2       R/W LEFT_PAD_SMT                    1'b0
    3       R/W RIGHT_PAD_SMT                   1'b0
    4       R/W POWPAD1                         1'b1
    31:5    R   RSVD                            27'h0
 */
typedef volatile union _AON_NS_COMMON_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TOP_PAD_SMT: 1;
        uint32_t BOT_PAD_SMT: 1;
        uint32_t LEFT_PAD_SMT: 1;
        uint32_t RIGHT_PAD_SMT: 1;
        uint32_t POWPAD1: 1;
        uint32_t RSVD: 27;
    };
} AON_NS_COMMON_PAD_CFG_TYPE;

/* 0x1954   0x4000_1954
    0       R   RSVD                            1'b1
    1       R   RSVD                            1'b1
    2       R   RSVD                            1'b0
    3       R   RSVD                            1'b0
    4       R   RSVD                            1'b0
    5       R   RSVD                            1'b0
    6       R   RSVD                            1'b0
    7       R   RSVD                            1'b0
    8       R   RSVD                            1'b0
    9       R   RSVD                            1'b0
    10      R   RSVD                            1'b0
    11      R   RSVD                            1'b0
    12      R   RSVD                            1'b0
    13      R   RSVD                            1'b0
    14      R   RSVD                            1'b1
    15      R   RSVD                            1'b1
    16      R   RSVD                            1'b0
    17      R   RSVD                            1'b0
    18      R   RSVD                            1'b0
    19      R   RSVD                            1'b0
    20      R   RSVD                            1'b0
    21      R   RSVD                            1'b0
    31:22   R   RSVD                            10'h0
 */
typedef volatile union _AON_NS_P_SPI_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD_22: 1;
        uint32_t RSVD_21: 1;
        uint32_t RSVD_20: 1;
        uint32_t RSVD_19: 1;
        uint32_t RSVD_18: 1;
        uint32_t RSVD_17: 1;
        uint32_t RSVD_16: 1;
        uint32_t RSVD_15: 1;
        uint32_t RSVD_14: 1;
        uint32_t RSVD_13: 1;
        uint32_t RSVD_12: 1;
        uint32_t RSVD_11: 1;
        uint32_t RSVD_10: 1;
        uint32_t RSVD_9: 1;
        uint32_t RSVD_8: 1;
        uint32_t RSVD_7: 1;
        uint32_t RSVD_6: 1;
        uint32_t RSVD_5: 1;
        uint32_t RSVD_4: 1;
        uint32_t RSVD_3: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 10;
    };
} AON_NS_P_SPI_PAD_CFG_TYPE;

/* 0x1958   0x4000_1958
    0       R/W PAD_DAC_N_O                     1'b0
    1       R/W PAD_DAC_N_E                     1'b0
    2       R/W PAD_DAC_N_PU_EN                 1'b1
    3       R/W AON_PAD_DAC_N_PD                1'b1
    4       R/W PAD_DAC_N_PUPDC                 1'b0
    5       R/W PAD_DAC_N_WKEN                  1'b0
    6       R/W PAD_DAC_N_WKPOL                 1'b0
    7       R/W PAD_DAC_N_E2                    1'b1
    8       R/W PAD_DAC_N_SHDN                  1'b1
    9       R/W PAD_DAC_N_S                     1'b0
    10      R/W PAD_DAC_N_DEB                   1'b0
    12:11   R   RSVD                            2'b0
    13      R/W PAD_DAC_N_dummy                 1'b0
    14      R   RSVD                            1'h0
    15      R/W PAD_DAC_N_O_EN                  1'h1
    16      R/W PAD_DAC_P_O                     1'b0
    17      R/W PAD_DAC_P_E                     1'b0
    18      R/W PAD_DAC_P_PU_EN                 1'b1
    19      R/W AON_PAD_DAC_P_PD                1'b1
    20      R/W PAD_DAC_P_PUPDC                 1'b0
    21      R/W PAD_DAC_P_WKEN                  1'b0
    22      R/W PAD_DAC_P_WKPOL                 1'b0
    23      R/W PAD_DAC_N_E2                    1'b1
    24      R/W PAD_DAC_P_SHDN                  1'b1
    25      R/W PAD_DAC_P_S                     1'b0
    26      R/W PAD_DAC_P_DEB                   1'b0
    28:27   R   RSVD                            2'b0
    29      R/W PAD_DAC_P_dummy                 1'b0
    30      R   RSVD                            1'h0
    31      R/W PAD_DAC_P_O_EN                  1'h1
 */
typedef volatile union _AON_NS_DAC_P_DAC_N_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_DAC_N_O: 1;
        uint32_t PAD_DAC_N_E: 1;
        uint32_t PAD_DAC_N_PU_EN: 1;
        uint32_t AON_PAD_DAC_N_PD: 1;
        uint32_t PAD_DAC_N_PUPDC: 1;
        uint32_t PAD_DAC_N_WKEN: 1;
        uint32_t PAD_DAC_N_WKPOL: 1;
        uint32_t PAD_DAC_N_E2_1: 1;
        uint32_t PAD_DAC_N_SHDN: 1;
        uint32_t PAD_DAC_N_S: 1;
        uint32_t PAD_DAC_N_DEB: 1;
        uint32_t RSVD_3: 2;
        uint32_t PAD_DAC_N_dummy: 1;
        uint32_t RSVD_2: 1;
        uint32_t PAD_DAC_N_O_EN: 1;
        uint32_t PAD_DAC_P_O: 1;
        uint32_t PAD_DAC_P_E: 1;
        uint32_t PAD_DAC_P_PU_EN: 1;
        uint32_t AON_PAD_DAC_P_PD: 1;
        uint32_t PAD_DAC_P_PUPDC: 1;
        uint32_t PAD_DAC_P_WKEN: 1;
        uint32_t PAD_DAC_P_WKPOL: 1;
        uint32_t PAD_DAC_N_E2: 1;
        uint32_t PAD_DAC_P_SHDN: 1;
        uint32_t PAD_DAC_P_S: 1;
        uint32_t PAD_DAC_P_DEB: 1;
        uint32_t RSVD_1: 2;
        uint32_t PAD_DAC_P_dummy: 1;
        uint32_t RSVD: 1;
        uint32_t PAD_DAC_P_O_EN: 1;
    };
} AON_NS_DAC_P_DAC_N_PAD_CFG_TYPE;

