rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/aon_reg.h
/* 0x195C   0x4000_195c
    0       R/W PAD_P4_O[4]                     1'b0
    1       R/W PAD_P4_E[4]                     1'b0
    2       R/W PAD_P4_PU_EN[4]                 1'b1
    3       R/W AON_PAD_P4_PD[4]                1'b1
    4       R/W PAD_P4_PUPDC[4]                 1'b0
    5       R/W PAD_P4_WKEN[4]                  1'b0
    6       R/W PAD_P4_WKPOL[4]                 1'b0
    7       R/W PAD_P4_E2[4]                    1'b1
    8       R/W PAD_P4_SHDN[4]                  1'b1
    9       R/W PAD_P4_S[4]                     1'b0
    10      R/W PAD_P4_DEB[4]                   1'b0
    11      R/W PAD_P4_HS_MUX[4]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P4_O_EN[4]                  1'h1
    16      R/W PAD_P4_O[5]                     1'b0
    17      R/W PAD_P4_E[5]                     1'b0
    18      R/W PAD_P4_PU_EN[5]                 1'b1
    19      R/W AON_PAD_P4_PD[5]                1'b1
    20      R/W PAD_P4_PUPDC[5]                 1'b0
    21      R/W PAD_P4_WKEN[5]                  1'b0
    22      R/W PAD_P4_WKPOL[5]                 1'b0
    23      R/W PAD_P4_E2[5]                    1'b1
    24      R/W PAD_P4_SHDN[5]                  1'b1
    25      R/W PAD_P4_S[5]                     1'b0
    26      R/W PAD_P4_DEB[5]                   1'b0
    27      R/W PAD_P4_HS_MUX[5]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P4_O_EN[5]                  1'h1
 */
typedef volatile union _AON_NS_P4_4_P4_5_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P4_O_4: 1;
        uint32_t PAD_P4_E_4: 1;
        uint32_t PAD_P4_PU_EN_4: 1;
        uint32_t AON_PAD_P4_PD_4: 1;
        uint32_t PAD_P4_PUPDC_4: 1;
        uint32_t PAD_P4_WKEN_4: 1;
        uint32_t PAD_P4_WKPOL_4: 1;
        uint32_t PAD_P4_E2_4: 1;
        uint32_t PAD_P4_SHDN_4: 1;
        uint32_t PAD_P4_S_4: 1;
        uint32_t PAD_P4_DEB_4: 1;
        uint32_t PAD_P4_HS_MUX_4: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P4_O_EN_4: 1;
        uint32_t PAD_P4_O_5: 1;
        uint32_t PAD_P4_E_5: 1;
        uint32_t PAD_P4_PU_EN_5: 1;
        uint32_t AON_PAD_P4_PD_5: 1;
        uint32_t PAD_P4_PUPDC_5: 1;
        uint32_t PAD_P4_WKEN_5: 1;
        uint32_t PAD_P4_WKPOL_5: 1;
        uint32_t PAD_P4_E2_5: 1;
        uint32_t PAD_P4_SHDN_5: 1;
        uint32_t PAD_P4_S_5: 1;
        uint32_t PAD_P4_DEB_5: 1;
        uint32_t PAD_P4_HS_MUX_5: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P4_O_EN_5: 1;
    };
} AON_NS_P4_4_P4_5_PAD_CFG_TYPE;

/* 0x1960   0x4000_1960
    0       R/W PAD_P4_O[6]                     1'b0
    1       R/W PAD_P4_E[6]                     1'b0
    2       R/W PAD_P4_PU_EN[6]                 1'b1
    3       R/W AON_PAD_P4_PD[6]                1'b1
    4       R/W PAD_P4_PUPDC[6]                 1'b0
    5       R/W PAD_P4_WKEN[6]                  1'b0
    6       R/W PAD_P4_WKPOL[6]                 1'b0
    7       R/W PAD_P4_E2[6]                    1'b1
    8       R/W PAD_P4_SHDN[6]                  1'b1
    9       R/W PAD_P4_S[6]                     1'b0
    10      R/W PAD_P4_DEB[6]                   1'b0
    11      R/W PAD_P4_HS_MUX[6]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P4_O_EN[6]                  1'h1
    16      R/W PAD_P4_O[7]                     1'b0
    17      R/W PAD_P4_E[7]                     1'b0
    18      R/W PAD_P4_PU_EN[7]                 1'b1
    19      R/W AON_PAD_P4_PD[7]                1'b1
    20      R/W PAD_P4_PUPDC[7]                 1'b0
    21      R/W PAD_P4_WKEN[7]                  1'b0
    22      R/W PAD_P4_WKPOL[7]                 1'b0
    23      R/W PAD_P4_E2[7]                    1'b1
    24      R/W PAD_P4_SHDN[7]                  1'b1
    25      R/W PAD_P4_S[7]                     1'b0
    26      R/W PAD_P4_DEB[7]                   1'b0
    27      R/W PAD_P4_HS_MUX[7]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P4_O_EN[7]                  1'h1
 */
typedef volatile union _AON_NS_P4_6_P4_7_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P4_O_6: 1;
        uint32_t PAD_P4_E_6: 1;
        uint32_t PAD_P4_PU_EN_6: 1;
        uint32_t AON_PAD_P4_PD_6: 1;
        uint32_t PAD_P4_PUPDC_6: 1;
        uint32_t PAD_P4_WKEN_6: 1;
        uint32_t PAD_P4_WKPOL_6: 1;
        uint32_t PAD_P4_E2_6: 1;
        uint32_t PAD_P4_SHDN_6: 1;
        uint32_t PAD_P4_S_6: 1;
        uint32_t PAD_P4_DEB_6: 1;
        uint32_t PAD_P4_HS_MUX_6: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P4_O_EN_6: 1;
        uint32_t PAD_P4_O_7: 1;
        uint32_t PAD_P4_E_7: 1;
        uint32_t PAD_P4_PU_EN_7: 1;
        uint32_t AON_PAD_P4_PD_7: 1;
        uint32_t PAD_P4_PUPDC_7: 1;
        uint32_t PAD_P4_WKEN_7: 1;
        uint32_t PAD_P4_WKPOL_7: 1;
        uint32_t PAD_P4_E2_7: 1;
        uint32_t PAD_P4_SHDN_7: 1;
        uint32_t PAD_P4_S_7: 1;
        uint32_t PAD_P4_DEB_7: 1;
        uint32_t PAD_P4_HS_MUX_7: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P4_O_EN_7: 1;
    };
} AON_NS_P4_6_P4_7_PAD_CFG_TYPE;

/* 0x1964   0x4000_1964
    0       R/W PAD_P5_O[0]                     1'b0
    1       R/W PAD_P5_E[0]                     1'b0
    2       R/W PAD_P5_PU_EN[0]                 1'b1
    3       R/W AON_PAD_P5_PD[0]                1'b1
    4       R/W PAD_P5_PUPDC[0]                 1'b0
    5       R/W PAD_P5_WKEN[0]                  1'b0
    6       R/W PAD_P5_WKPOL[0]                 1'b0
    7       R/W PAD_P5_E2[0]                    1'b1
    8       R/W PAD_P5_SHDN[0]                  1'b1
    9       R/W PAD_P5_S[0]                     1'b0
    10      R/W PAD_P5_DEB[0]                   1'b0
    11      R/W PAD_P5_HS_MUX[0]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P5_O_EN[0]                  1'h1
    16      R/W PAD_P5_O[1]                     1'b0
    17      R/W PAD_P5_E[1]                     1'b0
    18      R/W PAD_P5_PU_EN[1]                 1'b1
    19      R/W AON_PAD_P5_PD[1]                1'b1
    20      R/W PAD_P5_PUPDC[1]                 1'b0
    21      R/W PAD_P5_WKEN[1]                  1'b0
    22      R/W PAD_P5_WKPOL[1]                 1'b0
    23      R/W PAD_P5_E2[1]                    1'b1
    24      R/W PAD_P5_SHDN[1]                  1'b1
    25      R/W PAD_P5_S[1]                     1'b0
    26      R/W PAD_P5_DEB[1]                   1'b0
    27      R/W PAD_P5_HS_MUX[1]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P5_O_EN[1]                  1'h1
 */
typedef volatile union _AON_NS_P5_0_P5_1_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P5_O_0: 1;
        uint32_t PAD_P5_E_0: 1;
        uint32_t PAD_P5_PU_EN_0: 1;
        uint32_t AON_PAD_P5_PD_0: 1;
        uint32_t PAD_P5_PUPDC_0: 1;
        uint32_t PAD_P5_WKEN_0: 1;
        uint32_t PAD_P5_WKPOL_0: 1;
        uint32_t PAD_P5_E2_0: 1;
        uint32_t PAD_P5_SHDN_0: 1;
        uint32_t PAD_P5_S_0: 1;
        uint32_t PAD_P5_DEB_0: 1;
        uint32_t PAD_P5_HS_MUX_0: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P5_O_EN_0: 1;
        uint32_t PAD_P5_O_1: 1;
        uint32_t PAD_P5_E_1: 1;
        uint32_t PAD_P5_PU_EN_1: 1;
        uint32_t AON_PAD_P5_PD_1: 1;
        uint32_t PAD_P5_PUPDC_1: 1;
        uint32_t PAD_P5_WKEN_1: 1;
        uint32_t PAD_P5_WKPOL_1: 1;
        uint32_t PAD_P5_E2_1: 1;
        uint32_t PAD_P5_SHDN_1: 1;
        uint32_t PAD_P5_S_1: 1;
        uint32_t PAD_P5_DEB_1: 1;
        uint32_t PAD_P5_HS_MUX_1: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P5_O_EN_1: 1;
    };
} AON_NS_P5_0_P5_1_PAD_CFG_TYPE;

/* 0x1968   0x4000_1968
    0       R/W PAD_P5_O[2]                     1'b0
    1       R/W PAD_P5_E[2]                     1'b0
    2       R/W PAD_P5_PU_EN[2]                 1'b1
    3       R/W AON_PAD_P5_PD[2]                1'b0
    4       R/W PAD_P5_PUPDC[2]                 1'b0
    5       R/W PAD_P5_WKEN[2]                  1'b0
    6       R/W PAD_P5_WKPOL[2]                 1'b0
    7       R/W PAD_P5_E2[2]                    1'b1
    8       R/W PAD_P5_SHDN[2]                  1'b1
    9       R/W PAD_P5_S[2]                     1'b0
    10      R/W PAD_P5_DEB[2]                   1'b0
    11      R/W PAD_P5_HS_MUX[2]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P5_O_EN[2]                  1'h1
    16      R/W PAD_P5_O[3]                     1'b0
    17      R/W PAD_P5_E[3]                     1'b0
    18      R/W PAD_P5_PU_EN[3]                 1'b1
    19      R/W AON_PAD_P5_PD[3]                1'b1
    20      R/W PAD_P5_PUPDC[3]                 1'b0
    21      R/W PAD_P5_WKEN[3]                  1'b0
    22      R/W PAD_P5_WKPOL[3]                 1'b0
    23      R/W PAD_P5_E2[3]                    1'b1
    24      R/W PAD_P5_SHDN[3]                  1'b1
    25      R/W PAD_P5_S[3]                     1'b0
    26      R/W PAD_P5_DEB[3]                   1'b0
    27      R/W PAD_P5_HS_MUX[3]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P5_O_EN[3]                  1'h1
 */
typedef volatile union _AON_NS_P5_2_P5_3_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P5_O_2: 1;
        uint32_t PAD_P5_E_2: 1;
        uint32_t PAD_P5_PU_EN_2: 1;
        uint32_t AON_PAD_P5_PD_2: 1;
        uint32_t PAD_P5_PUPDC_2: 1;
        uint32_t PAD_P5_WKEN_2: 1;
        uint32_t PAD_P5_WKPOL_2: 1;
        uint32_t PAD_P5_E2_2: 1;
        uint32_t PAD_P5_SHDN_2: 1;
        uint32_t PAD_P5_S_2: 1;
        uint32_t PAD_P5_DEB_2: 1;
        uint32_t PAD_P5_HS_MUX_2: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P5_O_EN_2: 1;
        uint32_t PAD_P5_O_3: 1;
        uint32_t PAD_P5_E_3: 1;
        uint32_t PAD_P5_PU_EN_3: 1;
        uint32_t AON_PAD_P5_PD_3: 1;
        uint32_t PAD_P5_PUPDC_3: 1;
        uint32_t PAD_P5_WKEN_3: 1;
        uint32_t PAD_P5_WKPOL_3: 1;
        uint32_t PAD_P5_E2_3: 1;
        uint32_t PAD_P5_SHDN_3: 1;
        uint32_t PAD_P5_S_3: 1;
        uint32_t PAD_P5_DEB_3: 1;
        uint32_t PAD_P5_HS_MUX_3: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P5_O_EN_3: 1;
    };
} AON_NS_P5_2_P5_3_PAD_CFG_TYPE;

/* 0x196C   0x4000_196c
    0       R/W PAD_P5_O[4]                     1'b0
    1       R/W PAD_P5_E[4]                     1'b0
    2       R/W PAD_P5_PU_EN[4]                 1'b1
    3       R/W AON_PAD_P5_PD[4]                1'b1
    4       R/W PAD_P5_PUPDC[4]                 1'b0
    5       R/W PAD_P5_WKEN[4]                  1'b0
    6       R/W PAD_P5_WKPOL[4]                 1'b0
    7       R/W PAD_P5_E2[4]                    1'b1
    8       R/W PAD_P5_SHDN[4]                  1'b1
    9       R/W PAD_P5_S[4]                     1'b0
    10      R/W PAD_P5_DEB[4]                   1'b0
    11      R/W PAD_P5_HS_MUX[4]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P5_O_EN[4]                  1'h1
    16      R/W PAD_P5_O[5]                     1'b0
    17      R/W PAD_P5_E[5]                     1'b0
    18      R/W PAD_P5_PU_EN[5]                 1'b1
    19      R/W AON_PAD_P5_PD[5]                1'b1
    20      R/W PAD_P5_PUPDC[5]                 1'b0
    21      R/W PAD_P5_WKEN[5]                  1'b0
    22      R/W PAD_P5_WKPOL[5]                 1'b0
    23      R/W PAD_P5_E2[5]                    1'b1
    24      R/W PAD_P5_SHDN[5]                  1'b1
    25      R/W PAD_P5_S[5]                     1'b0
    26      R/W PAD_P5_DEB[5]                   1'b0
    27      R/W PAD_P5_HS_MUX[5]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P5_O_EN[5]                  1'h1
 */
typedef volatile union _AON_NS_P5_4_P5_5_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P5_O_4: 1;
        uint32_t PAD_P5_E_4: 1;
        uint32_t PAD_P5_PU_EN_4: 1;
        uint32_t AON_PAD_P5_PD_4: 1;
        uint32_t PAD_P5_PUPDC_4: 1;
        uint32_t PAD_P5_WKEN_4: 1;
        uint32_t PAD_P5_WKPOL_4: 1;
        uint32_t PAD_P5_E2_4: 1;
        uint32_t PAD_P5_SHDN_4: 1;
        uint32_t PAD_P5_S_4: 1;
        uint32_t PAD_P5_DEB_4: 1;
        uint32_t PAD_P5_HS_MUX_4: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P5_O_EN_4: 1;
        uint32_t PAD_P5_O_5: 1;
        uint32_t PAD_P5_E_5: 1;
        uint32_t PAD_P5_PU_EN_5: 1;
        uint32_t AON_PAD_P5_PD_5: 1;
        uint32_t PAD_P5_PUPDC_5: 1;
        uint32_t PAD_P5_WKEN_5: 1;
        uint32_t PAD_P5_WKPOL_5: 1;
        uint32_t PAD_P5_E2_5: 1;
        uint32_t PAD_P5_SHDN_5: 1;
        uint32_t PAD_P5_S_5: 1;
        uint32_t PAD_P5_DEB_5: 1;
        uint32_t PAD_P5_HS_MUX_5: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P5_O_EN_5: 1;
    };
} AON_NS_P5_4_P5_5_PAD_CFG_TYPE;

/* 0x1970   0x4000_1970
    0       R/W PAD_P5_O[6]                     1'b0
    1       R/W PAD_P5_E[6]                     1'b0
    2       R/W PAD_P5_PU_EN[6]                 1'b1
    3       R/W AON_PAD_P5_PD[6]                1'b1
    4       R/W PAD_P5_PUPDC[6]                 1'b0
    5       R/W PAD_P5_WKEN[6]                  1'b0
    6       R/W PAD_P5_WKPOL[6]                 1'b0
    7       R/W PAD_P5_E2[6]                    1'b1
    8       R/W PAD_P5_SHDN[6]                  1'b1
    9       R/W PAD_P5_S[6]                     1'b0
    10      R/W PAD_P5_DEB[6]                   1'b0
    14:11   R   RSVD                            4'b0
    15      R/W PAD_P5_O_EN[6]                  1'h1
    16      R/W PAD_P5_O[7]                     1'b0
    17      R/W PAD_P5_E[7]                     1'b0
    18      R/W PAD_P5_PU_EN[7]                 1'b1
    19      R/W AON_PAD_P5_PD[7]                1'b1
    20      R/W PAD_P5_PUPDC[7]                 1'b0
    21      R/W PAD_P5_WKEN[7]                  1'b0
    22      R/W PAD_P5_WKPOL[7]                 1'b0
    23      R/W PAD_P5_E2[7]                    1'b1
    24      R/W PAD_P5_SHDN[7]                  1'b1
    25      R/W PAD_P5_S[7]                     1'b0
    26      R/W PAD_P5_DEB[7]                   1'b0
    30:27   R   RSVD                            4'b0
    31      R/W PAD_P5_O_EN[7]                  1'h1
 */
typedef volatile union _AON_NS_P5_6_P5_7_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P5_O_6: 1;
        uint32_t PAD_P5_E_6: 1;
        uint32_t PAD_P5_PU_EN_6: 1;
        uint32_t AON_PAD_P5_PD_6: 1;
        uint32_t PAD_P5_PUPDC_6: 1;
        uint32_t PAD_P5_WKEN_6: 1;
        uint32_t PAD_P5_WKPOL_6: 1;
        uint32_t PAD_P5_E2_6: 1;
        uint32_t PAD_P5_SHDN_6: 1;
        uint32_t PAD_P5_S_6: 1;
        uint32_t PAD_P5_DEB_6: 1;
        uint32_t RSVD_1: 4;
        uint32_t PAD_P5_O_EN_6: 1;
        uint32_t PAD_P5_O_7: 1;
        uint32_t PAD_P5_E_7: 1;
        uint32_t PAD_P5_PU_EN_7: 1;
        uint32_t AON_PAD_P5_PD_7: 1;
        uint32_t PAD_P5_PUPDC_7: 1;
        uint32_t PAD_P5_WKEN_7: 1;
        uint32_t PAD_P5_WKPOL_7: 1;
        uint32_t PAD_P5_E2_7: 1;
        uint32_t PAD_P5_SHDN_7: 1;
        uint32_t PAD_P5_S_7: 1;
        uint32_t PAD_P5_DEB_7: 1;
        uint32_t RSVD: 4;
        uint32_t PAD_P5_O_EN_7: 1;
    };
} AON_NS_P5_6_P5_7_PAD_CFG_TYPE;

