rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/aon_reg.h
/* 0x1974   0x4000_1974
    0       R/W PAD_P6_O[0]                     1'b0
    1       R/W PAD_P6_E[0]                     1'b0
    2       R/W PAD_P6_PU_EN[0]                 1'b1
    3       R/W AON_PAD_P6_PD[0]                1'b1
    4       R/W PAD_P6_PUPDC[0]                 1'b0
    5       R/W PAD_P6_WKEN[0]                  1'b0
    6       R/W PAD_P6_WKPOL[0]                 1'b0
    7       R/W PAD_P6_E2[0]                    1'b1
    8       R/W PAD_P6_SHDN[0]                  1'b1
    9       R/W PAD_P6_S[0]                     1'b0
    10      R/W PAD_P6_DEB[0]                   1'b0
    11      R/W PAD_P6_HS_MUX[0]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P6_O_EN[0]                  1'h1
    16      R/W PAD_P6_O[1]                     1'b0
    17      R/W PAD_P6_E[1]                     1'b0
    18      R/W PAD_P6_PU_EN[1]                 1'b1
    19      R/W AON_PAD_P6_PD[1]                1'b1
    20      R/W PAD_P6_PUPDC[1]                 1'b0
    21      R/W PAD_P6_WKEN[1]                  1'b0
    22      R/W PAD_P6_WKPOL[1]                 1'b0
    23      R/W PAD_P6_E2[1]                    1'b1
    24      R/W PAD_P6_SHDN[1]                  1'b1
    25      R/W PAD_P6_S[1]                     1'b0
    26      R/W PAD_P6_DEB[1]                   1'b0
    27      R/W PAD_P6_HS_MUX[1]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P6_O_EN[1]                  1'h1
 */
typedef volatile union _AON_NS_P6_0_P6_1_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P6_O_0: 1;
        uint32_t PAD_P6_E_0: 1;
        uint32_t PAD_P6_PU_EN_0: 1;
        uint32_t AON_PAD_P6_PD_0: 1;
        uint32_t PAD_P6_PUPDC_0: 1;
        uint32_t PAD_P6_WKEN_0: 1;
        uint32_t PAD_P6_WKPOL_0: 1;
        uint32_t PAD_P6_E2_0: 1;
        uint32_t PAD_P6_SHDN_0: 1;
        uint32_t PAD_P6_S_0: 1;
        uint32_t PAD_P6_DEB_0: 1;
        uint32_t PAD_P6_HS_MUX_0: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P6_O_EN_0: 1;
        uint32_t PAD_P6_O_1: 1;
        uint32_t PAD_P6_E_1: 1;
        uint32_t PAD_P6_PU_EN_1: 1;
        uint32_t AON_PAD_P6_PD_1: 1;
        uint32_t PAD_P6_PUPDC_1: 1;
        uint32_t PAD_P6_WKEN_1: 1;
        uint32_t PAD_P6_WKPOL_1: 1;
        uint32_t PAD_P6_E2_1: 1;
        uint32_t PAD_P6_SHDN_1: 1;
        uint32_t PAD_P6_S_1: 1;
        uint32_t PAD_P6_DEB_1: 1;
        uint32_t PAD_P6_HS_MUX_1: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P6_O_EN_1: 1;
    };
} AON_NS_P6_0_P6_1_PAD_CFG_TYPE;

/* 0x1978   0x4000_1978
    0       R/W PAD_P6_O[2]                     1'b0
    1       R/W PAD_P6_E[2]                     1'b0
    2       R/W PAD_P6_PU_EN[2]                 1'b1
    3       R/W AON_PAD_P6_PD[2]                1'b1
    4       R/W PAD_P6_PUPDC[2]                 1'b0
    5       R/W PAD_P6_WKEN[2]                  1'b0
    6       R/W PAD_P6_WKPOL[2]                 1'b0
    7       R/W PAD_P6_E2[2]                    1'b1
    8       R/W PAD_P6_SHDN[2]                  1'b1
    9       R/W PAD_P6_S[2]                     1'b0
    10      R/W PAD_P6_DEB[2]                   1'b0
    11      R/W PAD_P6_HS_MUX[2]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P6_O_EN[2]                  1'h1
    16      R/W PAD_P6_O[3]                     1'b0
    17      R/W PAD_P6_E[3]                     1'b0
    18      R/W PAD_P6_PU_EN[3]                 1'b1
    19      R/W AON_PAD_P6_PD[3]                1'b1
    20      R/W PAD_P6_PUPDC[3]                 1'b0
    21      R/W PAD_P6_WKEN[3]                  1'b0
    22      R/W PAD_P6_WKPOL[3]                 1'b0
    23      R/W PAD_P6_E2[3]                    1'b1
    24      R/W PAD_P6_SHDN[3]                  1'b1
    25      R/W PAD_P6_S[3]                     1'b0
    26      R/W PAD_P6_DEB[3]                   1'b0
    27      R/W PAD_P6_HS_MUX[3]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P6_O_EN[3]                  1'h1
 */
typedef volatile union _AON_NS_P6_2_P6_3_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P6_O_2: 1;
        uint32_t PAD_P6_E_2: 1;
        uint32_t PAD_P6_PU_EN_2: 1;
        uint32_t AON_PAD_P6_PD_2: 1;
        uint32_t PAD_P6_PUPDC_2: 1;
        uint32_t PAD_P6_WKEN_2: 1;
        uint32_t PAD_P6_WKPOL_2: 1;
        uint32_t PAD_P6_E2_2: 1;
        uint32_t PAD_P6_SHDN_2: 1;
        uint32_t PAD_P6_S_2: 1;
        uint32_t PAD_P6_DEB_2: 1;
        uint32_t PAD_P6_HS_MUX_2: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P6_O_EN_2: 1;
        uint32_t PAD_P6_O_3: 1;
        uint32_t PAD_P6_E_3: 1;
        uint32_t PAD_P6_PU_EN_3: 1;
        uint32_t AON_PAD_P6_PD_3: 1;
        uint32_t PAD_P6_PUPDC_3: 1;
        uint32_t PAD_P6_WKEN_3: 1;
        uint32_t PAD_P6_WKPOL_3: 1;
        uint32_t PAD_P6_E2_3: 1;
        uint32_t PAD_P6_SHDN_3: 1;
        uint32_t PAD_P6_S_3: 1;
        uint32_t PAD_P6_DEB_3: 1;
        uint32_t PAD_P6_HS_MUX_3: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P6_O_EN_3: 1;
    };
} AON_NS_P6_2_P6_3_PAD_CFG_TYPE;

/* 0x197C   0x4000_197c
    0       R/W PAD_P6_O[4]                     1'b0
    1       R/W PAD_P6_E[4]                     1'b0
    2       R/W PAD_P6_PU_EN[4]                 1'b1
    3       R/W AON_PAD_P6_PD[4]                1'b1
    4       R/W PAD_P6_PUPDC[4]                 1'b0
    5       R/W PAD_P6_WKEN[4]                  1'b0
    6       R/W PAD_P6_WKPOL[4]                 1'b0
    7       R/W PAD_P6_E2[4]                    1'b1
    8       R/W PAD_P6_SHDN[4]                  1'b1
    9       R/W PAD_P6_S[4]                     1'b0
    10      R/W PAD_P6_DEB[4]                   1'b0
    11      R/W PAD_P6_HS_MUX[4]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P6_O_EN[4]                  1'h1
    16      R/W PAD_P6_O[5]                     1'b0
    17      R/W PAD_P6_E[5]                     1'b0
    18      R/W PAD_P6_PU_EN[5]                 1'b1
    19      R/W AON_PAD_P6_PD[5]                1'b0
    20      R/W PAD_P6_PUPDC[5]                 1'b0
    21      R/W PAD_P6_WKEN[5]                  1'b0
    22      R/W PAD_P6_WKPOL[5]                 1'b0
    23      R/W PAD_P6_E2[5]                    1'b1
    24      R/W PAD_P6_SHDN[5]                  1'b1
    25      R/W PAD_P6_S[5]                     1'b0
    26      R/W PAD_P6_DEB[5]                   1'b0
    27      R/W PAD_P6_HS_MUX[5]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P6_O_EN[5]                  1'h1
 */
typedef volatile union _AON_NS_P6_4_P6_5_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P6_O_4: 1;
        uint32_t PAD_P6_E_4: 1;
        uint32_t PAD_P6_PU_EN_4: 1;
        uint32_t AON_PAD_P6_PD_4: 1;
        uint32_t PAD_P6_PUPDC_4: 1;
        uint32_t PAD_P6_WKEN_4: 1;
        uint32_t PAD_P6_WKPOL_4: 1;
        uint32_t PAD_P6_E2_4: 1;
        uint32_t PAD_P6_SHDN_4: 1;
        uint32_t PAD_P6_S_4: 1;
        uint32_t PAD_P6_DEB_4: 1;
        uint32_t PAD_P6_HS_MUX_4: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P6_O_EN_4: 1;
        uint32_t PAD_P6_O_5: 1;
        uint32_t PAD_P6_E_5: 1;
        uint32_t PAD_P6_PU_EN_5: 1;
        uint32_t AON_PAD_P6_PD_5: 1;
        uint32_t PAD_P6_PUPDC_5: 1;
        uint32_t PAD_P6_WKEN_5: 1;
        uint32_t PAD_P6_WKPOL_5: 1;
        uint32_t PAD_P6_E2_5: 1;
        uint32_t PAD_P6_SHDN_5: 1;
        uint32_t PAD_P6_S_5: 1;
        uint32_t PAD_P6_DEB_5: 1;
        uint32_t PAD_P6_HS_MUX_5: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P6_O_EN_5: 1;
    };
} AON_NS_P6_4_P6_5_PAD_CFG_TYPE;

/* 0x1980   0x4000_1980
    0       R/W PAD_P6_O[6]                     1'b0
    1       R/W PAD_P6_E[6]                     1'b0
    2       R/W PAD_P6_PU_EN[6]                 1'b1
    3       R/W AON_PAD_P6_PD[6]                1'b1
    4       R/W PAD_P6_PUPDC[6]                 1'b0
    5       R/W PAD_P6_WKEN[6]                  1'b0
    6       R/W PAD_P6_WKPOL[6]                 1'b0
    7       R/W PAD_P6_E2[6]                    1'b1
    8       R/W PAD_P6_SHDN[6]                  1'b1
    9       R/W PAD_P6_S[6]                     1'b0
    10      R/W PAD_P6_DEB[6]                   1'b0
    11      R/W PAD_P6_HS_MUX[6]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P6_O_EN[6]                  1'h1
    16      R/W PAD_P6_O[7]                     1'b0
    17      R/W PAD_P6_E[7]                     1'b0
    18      R/W PAD_P6_PU_EN[7]                 1'b1
    19      R/W AON_PAD_P6_PD[7]                1'b0
    20      R/W PAD_P6_PUPDC[7]                 1'b0
    21      R/W PAD_P6_WKEN[7]                  1'b0
    22      R/W PAD_P6_WKPOL[7]                 1'b0
    23      R/W PAD_P6_E2[7]                    1'b1
    24      R/W PAD_P6_SHDN[7]                  1'b1
    25      R/W PAD_P6_S[7]                     1'b0
    26      R/W PAD_P6_DEB[7]                   1'b0
    27      R/W PAD_P6_HS_MUX[7]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P6_O_EN[7]                  1'h1
 */
typedef volatile union _AON_NS_P6_6_P6_7_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P6_O_6: 1;
        uint32_t PAD_P6_E_6: 1;
        uint32_t PAD_P6_PU_EN_6: 1;
        uint32_t AON_PAD_P6_PD_6: 1;
        uint32_t PAD_P6_PUPDC_6: 1;
        uint32_t PAD_P6_WKEN_6: 1;
        uint32_t PAD_P6_WKPOL_6: 1;
        uint32_t PAD_P6_E2_6: 1;
        uint32_t PAD_P6_SHDN_6: 1;
        uint32_t PAD_P6_S_6: 1;
        uint32_t PAD_P6_DEB_6: 1;
        uint32_t PAD_P6_HS_MUX_6: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P6_O_EN_6: 1;
        uint32_t PAD_P6_O_7: 1;
        uint32_t PAD_P6_E_7: 1;
        uint32_t PAD_P6_PU_EN_7: 1;
        uint32_t AON_PAD_P6_PD_7: 1;
        uint32_t PAD_P6_PUPDC_7: 1;
        uint32_t PAD_P6_WKEN_7: 1;
        uint32_t PAD_P6_WKPOL_7: 1;
        uint32_t PAD_P6_E2_7: 1;
        uint32_t PAD_P6_SHDN_7: 1;
        uint32_t PAD_P6_S_7: 1;
        uint32_t PAD_P6_DEB_7: 1;
        uint32_t PAD_P6_HS_MUX_7: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P6_O_EN_7: 1;
    };
} AON_NS_P6_6_P6_7_PAD_CFG_TYPE;

/* 0x1984   0x4000_1984
    0       R/W PAD_P7_O[0]                     1'b0
    1       R/W PAD_P7_E[0]                     1'b0
    2       R/W PAD_P7_PU_EN[0]                 1'b1
    3       R/W AON_PAD_P7_PD[0]                1'b1
    4       R/W PAD_P7_PUPDC[0]                 1'b0
    5       R/W PAD_P7_WKEN[0]                  1'b0
    6       R/W PAD_P7_WKPOL[0]                 1'b0
    7       R/W PAD_P7_E2[0]                    1'b1
    8       R/W PAD_P7_SHDN[0]                  1'b1
    9       R/W PAD_P7_S[0]                     1'b0
    10      R/W PAD_P7_DEB[0]                   1'b0
    11      R/W PAD_P7_HS_MUX[0]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P7_O_EN[0]                  1'h1
    16      R/W PAD_P7_O[1]                     1'b0
    17      R/W PAD_P7_E[1]                     1'b0
    18      R/W PAD_P7_PU_EN[1]                 1'b1
    19      R/W AON_PAD_P7_PD[1]                1'b1
    20      R/W PAD_P7_PUPDC[1]                 1'b0
    21      R/W PAD_P7_WKEN[1]                  1'b0
    22      R/W PAD_P7_WKPOL[1]                 1'b0
    23      R/W PAD_P7_E2[1]                    1'b1
    24      R/W PAD_P7_SHDN[1]                  1'b1
    25      R/W PAD_P7_S[1]                     1'b0
    26      R/W PAD_P7_DEB[1]                   1'b0
    27      R/W PAD_P7_HS_MUX[1]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P7_O_EN[1]                  1'h1
 */
typedef volatile union _AON_NS_P7_0_P7_1_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P7_O_0: 1;
        uint32_t PAD_P7_E_0: 1;
        uint32_t PAD_P7_PU_EN_0: 1;
        uint32_t AON_PAD_P7_PD_0: 1;
        uint32_t PAD_P7_PUPDC_0: 1;
        uint32_t PAD_P7_WKEN_0: 1;
        uint32_t PAD_P7_WKPOL_0: 1;
        uint32_t PAD_P7_E2_0: 1;
        uint32_t PAD_P7_SHDN_0: 1;
        uint32_t PAD_P7_S_0: 1;
        uint32_t PAD_P7_DEB_0: 1;
        uint32_t PAD_P7_HS_MUX_0: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P7_O_EN_0: 1;
        uint32_t PAD_P7_O_1: 1;
        uint32_t PAD_P7_E_1: 1;
        uint32_t PAD_P7_PU_EN_1: 1;
        uint32_t AON_PAD_P7_PD_1: 1;
        uint32_t PAD_P7_PUPDC_1: 1;
        uint32_t PAD_P7_WKEN_1: 1;
        uint32_t PAD_P7_WKPOL_1: 1;
        uint32_t PAD_P7_E2_1: 1;
        uint32_t PAD_P7_SHDN_1: 1;
        uint32_t PAD_P7_S_1: 1;
        uint32_t PAD_P7_DEB_1: 1;
        uint32_t PAD_P7_HS_MUX_1: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P7_O_EN_1: 1;
    };
} AON_NS_P7_0_P7_1_PAD_CFG_TYPE;

/* 0x1988   0x4000_1988
    0       R/W PAD_P7_O[2]                     1'b0
    1       R/W PAD_P7_E[2]                     1'b0
    2       R/W PAD_P7_PU_EN[2]                 1'b1
    3       R/W AON_PAD_P7_PD[2]                1'b1
    4       R/W PAD_P7_PUPDC[2]                 1'b0
    5       R/W PAD_P7_WKEN[2]                  1'b0
    6       R/W PAD_P7_WKPOL[2]                 1'b0
    7       R/W PAD_P7_E2[2]                    1'b1
    8       R/W PAD_P7_SHDN[2]                  1'b1
    9       R/W PAD_P7_S[2]                     1'b0
    10      R/W PAD_P7_DEB[2]                   1'b0
    11      R/W PAD_P7_HS_MUX[2]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P7_O_EN[2]                  1'h1
    16      R/W PAD_P7_O[3]                     1'b0
    17      R/W PAD_P7_E[3]                     1'b0
    18      R/W PAD_P7_PU_EN[3]                 1'b1
    19      R/W AON_PAD_P7_PD[3]                1'b1
    20      R/W PAD_P7_PUPDC[3]                 1'b0
    21      R/W PAD_P7_WKEN[3]                  1'b0
    22      R/W PAD_P7_WKPOL[3]                 1'b0
    23      R/W PAD_P7_E2[3]                    1'b1
    24      R/W PAD_P7_SHDN[3]                  1'b1
    25      R/W PAD_P7_S[3]                     1'b0
    26      R/W PAD_P7_DEB[3]                   1'b0
    27      R/W PAD_P7_HS_MUX[3]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P7_O_EN[3]                  1'h1
 */
typedef volatile union _AON_NS_P7_2_P7_3_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P7_O_2: 1;
        uint32_t PAD_P7_E_2: 1;
        uint32_t PAD_P7_PU_EN_2: 1;
        uint32_t AON_PAD_P7_PD_2: 1;
        uint32_t PAD_P7_PUPDC_2: 1;
        uint32_t PAD_P7_WKEN_2: 1;
        uint32_t PAD_P7_WKPOL_2: 1;
        uint32_t PAD_P7_E2_2: 1;
        uint32_t PAD_P7_SHDN_2: 1;
        uint32_t PAD_P7_S_2: 1;
        uint32_t PAD_P7_DEB_2: 1;
        uint32_t PAD_P7_HS_MUX_2: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P7_O_EN_2: 1;
        uint32_t PAD_P7_O_3: 1;
        uint32_t PAD_P7_E_3: 1;
        uint32_t PAD_P7_PU_EN_3: 1;
        uint32_t AON_PAD_P7_PD_3: 1;
        uint32_t PAD_P7_PUPDC_3: 1;
        uint32_t PAD_P7_WKEN_3: 1;
        uint32_t PAD_P7_WKPOL_3: 1;
        uint32_t PAD_P7_E2_3: 1;
        uint32_t PAD_P7_SHDN_3: 1;
        uint32_t PAD_P7_S_3: 1;
        uint32_t PAD_P7_DEB_3: 1;
        uint32_t PAD_P7_HS_MUX_3: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P7_O_EN_3: 1;
    };
} AON_NS_P7_2_P7_3_PAD_CFG_TYPE;

