rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/aon_reg.h
/* 0x199C   0x4000_199c
    0       R/W PAD_SPI_SIO2_O                  1'b0
    1       R/W PAD_SPI_SIO2_E                  1'b0
    2       R/W PAD_SPI_SIO2_PU_EN              1'b1
    3       R/W AON_PAD_SPI_SIO2_PD             1'b1
    4       R/W PAD_SPI_SIO2_PUPDC              1'b0
    5       R   RSVD                            1'b0
    6       R   RSVD                            1'b0
    7       R/W PAD_SPI_SIO2_E2                 1'b1
    8       R/W PAD_SPI_SIO2_SHDN               1'b1
    9       R   RSVD                            1'b0
    10      R   RSVD                            1'b0
    11      R/W PAD_SPI_SIO2_HS_MUX             1'b0
    15:12   R   RSVD                            4'b0
    16      R/W PAD_SPI_SIO3_O                  1'b0
    17      R/W PAD_SPI_SIO3_E                  1'b0
    18      R/W PAD_SPI_SIO3_PU_EN              1'b1
    19      R/W AON_PAD_SPI_SIO3_PD             1'b1
    20      R/W PAD_SPI_SIO3_PUPDC              1'b0
    21      R   RSVD                            1'b0
    22      R   RSVD                            1'b0
    23      R/W PAD_SPI_SIO3_E2                 1'b1
    24      R/W PAD_SPI_SIO3_SHDN               1'b1
    25      R   RSVD                            1'b0
    26      R   RSVD                            1'b0
    27      R/W PAD_SPI_SIO3_HS_MUX             1'b0
    31:28   R   RSVD                            4'b0
 */
typedef volatile union _AON_NS_SPIC0_PAD_CFG2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_SPI_SIO2_O: 1;
        uint32_t PAD_SPI_SIO2_E: 1;
        uint32_t PAD_SPI_SIO2_PU_EN: 1;
        uint32_t AON_PAD_SPI_SIO2_PD: 1;
        uint32_t PAD_SPI_SIO2_PUPDC: 1;
        uint32_t RSVD_9: 1;
        uint32_t RSVD_8: 1;
        uint32_t PAD_SPI_SIO2_E2: 1;
        uint32_t PAD_SPI_SIO2_SHDN: 1;
        uint32_t RSVD_7: 1;
        uint32_t RSVD_6: 1;
        uint32_t PAD_SPI_SIO2_HS_MUX: 1;
        uint32_t RSVD_5: 4;
        uint32_t PAD_SPI_SIO3_O: 1;
        uint32_t PAD_SPI_SIO3_E: 1;
        uint32_t PAD_SPI_SIO3_PU_EN: 1;
        uint32_t AON_PAD_SPI_SIO3_PD: 1;
        uint32_t PAD_SPI_SIO3_PUPDC: 1;
        uint32_t RSVD_4: 1;
        uint32_t RSVD_3: 1;
        uint32_t PAD_SPI_SIO3_E2: 1;
        uint32_t PAD_SPI_SIO3_SHDN: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t PAD_SPI_SIO3_HS_MUX: 1;
        uint32_t RSVD: 4;
    };
} AON_NS_SPIC0_PAD_CFG2_TYPE;

/* 0x19A0   0x4000_19a0
    31:0    R   RSVD                            32'b0
 */
typedef volatile union _AON_NS_P8_0_P8_1_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_NS_P8_0_P8_1_PAD_CFG_TYPE;

/* 0x19A4   0x4000_19a4
    31:0    R   RSVD                            32'b0
 */
typedef volatile union _AON_NS_P8_2_P8_3_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_NS_P8_2_P8_3_PAD_CFG_TYPE;

/* 0x19A8   0x4000_19a8
    31:0    R   RSVD                            32'b0
 */
typedef volatile union _AON_NS_P8_4_P8_5_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_NS_P8_4_P8_5_PAD_CFG_TYPE;

/* 0x19AC   0x4000_19ac
    31:0    R   RSVD                            32'b0
 */
typedef volatile union _AON_NS_P8_6_P8_7_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_NS_P8_6_P8_7_PAD_CFG_TYPE;

/* 0x19B0   0x4000_19b0
    0       R/W PAD_P9_O[0]                     1'b0
    1       R/W PAD_P9_E[0]                     1'b0
    2       R/W PAD_P9_PU_EN[0]                 1'b1
    3       R/W AON_PAD_P9_PD[0]                1'b1
    4       R/W PAD_P9_PUPDC[0]                 1'b0
    5       R/W PAD_P9_WKEN[0]                  1'b0
    6       R/W PAD_P9_WKPOL[0]                 1'b0
    7       R/W PAD_P9_E2[0]                    1'b1
    8       R/W PAD_P9_SHDN[0]                  1'b1
    9       R/W PAD_P9_S[0]                     1'b0
    10      R/W PAD_P9_DEB[0]                   1'b0
    11      R/W PAD_P9_HS_MUX[0]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P9_O_EN[0]                  1'h1
    16      R/W PAD_P9_O[1]                     1'b0
    17      R/W PAD_P9_E[1]                     1'b0
    18      R/W PAD_P9_PU_EN[1]                 1'b1
    19      R/W AON_PAD_P9_PD[1]                1'b1
    20      R/W PAD_P9_PUPDC[1]                 1'b0
    21      R/W PAD_P9_WKEN[1]                  1'b0
    22      R/W PAD_P9_WKPOL[1]                 1'b0
    23      R/W PAD_P9_E2[1]                    1'b1
    24      R/W PAD_P9_SHDN[1]                  1'b1
    25      R/W PAD_P9_S[1]                     1'b0
    26      R/W PAD_P9_DEB[1]                   1'b0
    27      R/W PAD_P9_HS_MUX[1]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P9_O_EN[1]                  1'h1
 */
typedef volatile union _AON_NS_P9_0_P9_1_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P9_O_0: 1;
        uint32_t PAD_P9_E_0: 1;
        uint32_t PAD_P9_PU_EN_0: 1;
        uint32_t AON_PAD_P9_PD_0: 1;
        uint32_t PAD_P9_PUPDC_0: 1;
        uint32_t PAD_P9_WKEN_0: 1;
        uint32_t PAD_P9_WKPOL_0: 1;
        uint32_t PAD_P9_E2_0: 1;
        uint32_t PAD_P9_SHDN_0: 1;
        uint32_t PAD_P9_S_0: 1;
        uint32_t PAD_P9_DEB_0: 1;
        uint32_t PAD_P9_HS_MUX_0: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P9_O_EN_0: 1;
        uint32_t PAD_P9_O_1: 1;
        uint32_t PAD_P9_E_1: 1;
        uint32_t PAD_P9_PU_EN_1: 1;
        uint32_t AON_PAD_P9_PD_1: 1;
        uint32_t PAD_P9_PUPDC_1: 1;
        uint32_t PAD_P9_WKEN_1: 1;
        uint32_t PAD_P9_WKPOL_1: 1;
        uint32_t PAD_P9_E2_1: 1;
        uint32_t PAD_P9_SHDN_1: 1;
        uint32_t PAD_P9_S_1: 1;
        uint32_t PAD_P9_DEB_1: 1;
        uint32_t PAD_P9_HS_MUX_1: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P9_O_EN_1: 1;
    };
} AON_NS_P9_0_P9_1_PAD_CFG_TYPE;

/* 0x19B4   0x4000_19b4
    0       R/W PAD_P9_O[2]                     1'b0
    1       R/W PAD_P9_E[2]                     1'b0
    2       R/W PAD_P9_PU_EN[2]                 1'b1
    3       R/W AON_PAD_P9_PD[2]                1'b1
    4       R/W PAD_P9_PUPDC[2]                 1'b0
    5       R/W PAD_P9_WKEN[2]                  1'b0
    6       R/W PAD_P9_WKPOL[2]                 1'b0
    7       R/W PAD_P9_E2[2]                    1'b1
    8       R/W PAD_P9_SHDN[2]                  1'b1
    9       R/W PAD_P9_S[2]                     1'b0
    10      R/W PAD_P9_DEB[2]                   1'b0
    11      R/W PAD_P9_HS_MUX[2]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P9_O_EN[2]                  1'h1
    16      R/W PAD_P9_O[3]                     1'b0
    17      R/W PAD_P9_E[3]                     1'b0
    18      R/W PAD_P9_PU_EN[3]                 1'b1
    19      R/W AON_PAD_P9_PD[3]                1'b0
    20      R/W PAD_P9_PUPDC[3]                 1'b0
    21      R/W PAD_P9_WKEN[3]                  1'b0
    22      R/W PAD_P9_WKPOL[3]                 1'b0
    23      R/W PAD_P9_E2[3]                    1'b1
    24      R/W PAD_P9_SHDN[3]                  1'b1
    25      R/W PAD_P9_S[3]                     1'b0
    26      R/W PAD_P9_DEB[3]                   1'b0
    27      R/W PAD_P9_HS_MUX[3]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P9_O_EN[3]                  1'h1
 */
typedef volatile union _AON_NS_P9_2_P9_3_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P9_O_2: 1;
        uint32_t PAD_P9_E_2: 1;
        uint32_t PAD_P9_PU_EN_2: 1;
        uint32_t AON_PAD_P9_PD_2: 1;
        uint32_t PAD_P9_PUPDC_2: 1;
        uint32_t PAD_P9_WKEN_2: 1;
        uint32_t PAD_P9_WKPOL_2: 1;
        uint32_t PAD_P9_E2_2: 1;
        uint32_t PAD_P9_SHDN_2: 1;
        uint32_t PAD_P9_S_2: 1;
        uint32_t PAD_P9_DEB_2: 1;
        uint32_t PAD_P9_HS_MUX_2: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P9_O_EN_2: 1;
        uint32_t PAD_P9_O_3: 1;
        uint32_t PAD_P9_E_3: 1;
        uint32_t PAD_P9_PU_EN_3: 1;
        uint32_t AON_PAD_P9_PD_3: 1;
        uint32_t PAD_P9_PUPDC_3: 1;
        uint32_t PAD_P9_WKEN_3: 1;
        uint32_t PAD_P9_WKPOL_3: 1;
        uint32_t PAD_P9_E2_3: 1;
        uint32_t PAD_P9_SHDN_3: 1;
        uint32_t PAD_P9_S_3: 1;
        uint32_t PAD_P9_DEB_3: 1;
        uint32_t PAD_P9_HS_MUX_3: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P9_O_EN_3: 1;
    };
} AON_NS_P9_2_P9_3_PAD_CFG_TYPE;

/* 0x19B8   0x4000_19b8
    0       R/W PAD_P9_O[4]                     1'b0
    1       R/W PAD_P9_E[4]                     1'b0
    2       R/W PAD_P9_PU_EN[4]                 1'b1
    3       R/W AON_PAD_P9_PD[4]                1'b0
    4       R/W PAD_P9_PUPDC[4]                 1'b0
    5       R/W PAD_P9_WKEN[4]                  1'b0
    6       R/W PAD_P9_WKPOL[4]                 1'b0
    7       R/W PAD_P9_E2[4]                    1'b1
    8       R/W PAD_P9_SHDN[4]                  1'b1
    9       R/W PAD_P9_S[4]                     1'b0
    10      R/W PAD_P9_DEB[4]                   1'b0
    11      R/W PAD_P9_HS_MUX[4]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P9_O_EN[4]                  1'h1
    16      R/W PAD_P9_O[5]                     1'b0
    17      R/W PAD_P9_E[5]                     1'b0
    18      R/W PAD_P9_PU_EN[5]                 1'b1
    19      R/W AON_PAD_P9_PD[5]                1'b1
    20      R/W PAD_P9_PUPDC[5]                 1'b0
    21      R/W PAD_P9_WKEN[5]                  1'b0
    22      R/W PAD_P9_WKPOL[5]                 1'b0
    23      R/W PAD_P9_E2[5]                    1'b1
    24      R/W PAD_P9_SHDN[5]                  1'b1
    25      R/W PAD_P9_S[5]                     1'b0
    26      R/W PAD_P9_DEB[5]                   1'b0
    27      R/W PAD_P9_HS_MUX[5]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P9_O_EN[5]                  1'h1
 */
typedef volatile union _AON_NS_P9_4_P9_5_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P9_O_4: 1;
        uint32_t PAD_P9_E_4: 1;
        uint32_t PAD_P9_PU_EN_4: 1;
        uint32_t AON_PAD_P9_PD_4: 1;
        uint32_t PAD_P9_PUPDC_4: 1;
        uint32_t PAD_P9_WKEN_4: 1;
        uint32_t PAD_P9_WKPOL_4: 1;
        uint32_t PAD_P9_E2_4: 1;
        uint32_t PAD_P9_SHDN_4: 1;
        uint32_t PAD_P9_S_4: 1;
        uint32_t PAD_P9_DEB_4: 1;
        uint32_t PAD_P9_HS_MUX_4: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P9_O_EN_4: 1;
        uint32_t PAD_P9_O_5: 1;
        uint32_t PAD_P9_E_5: 1;
        uint32_t PAD_P9_PU_EN_5: 1;
        uint32_t AON_PAD_P9_PD_5: 1;
        uint32_t PAD_P9_PUPDC_5: 1;
        uint32_t PAD_P9_WKEN_5: 1;
        uint32_t PAD_P9_WKPOL_5: 1;
        uint32_t PAD_P9_E2_5: 1;
        uint32_t PAD_P9_SHDN_5: 1;
        uint32_t PAD_P9_S_5: 1;
        uint32_t PAD_P9_DEB_5: 1;
        uint32_t PAD_P9_HS_MUX_5: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P9_O_EN_5: 1;
    };
} AON_NS_P9_4_P9_5_PAD_CFG_TYPE;

/* 0x19BC   0x4000_19bc
    0       R/W PAD_P9_O[6]                     1'b0
    1       R/W PAD_P9_E[6]                     1'b0
    2       R/W PAD_P9_PU_EN[6]                 1'b1
    3       R/W AON_PAD_P9_PD[6]                1'b1
    4       R/W PAD_P9_PUPDC[6]                 1'b0
    5       R/W PAD_P9_WKEN[6]                  1'b0
    6       R/W PAD_P9_WKPOL[6]                 1'b0
    7       R/W PAD_P9_E2[6]                    1'b1
    8       R/W PAD_P9_SHDN[6]                  1'b1
    9       R/W PAD_P9_S[6]                     1'b0
    10      R/W PAD_P9_DEB[6]                   1'b0
    11      R/W PAD_P9_HS_MUX[6]                1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P9_O_EN[6]                  1'h1
    16      R/W PAD_P9_O[7]                     1'b0
    17      R/W PAD_P9_E[7]                     1'b0
    18      R/W PAD_P9_PU_EN[7]                 1'b1
    19      R/W AON_PAD_P9_PD[7]                1'b1
    20      R/W PAD_P9_PUPDC[7]                 1'b0
    21      R/W PAD_P9_WKEN[7]                  1'b0
    22      R/W PAD_P9_WKPOL[7]                 1'b0
    23      R/W PAD_P9_E2[7]                    1'b1
    24      R/W PAD_P9_SHDN[7]                  1'b1
    25      R/W PAD_P9_S[7]                     1'b0
    26      R/W PAD_P9_DEB[7]                   1'b0
    27      R/W PAD_P9_HS_MUX[7]                1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P9_O_EN[7]                  1'h1
 */
typedef volatile union _AON_NS_P9_6_P9_7_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P9_O_6: 1;
        uint32_t PAD_P9_E_6: 1;
        uint32_t PAD_P9_PU_EN_6: 1;
        uint32_t AON_PAD_P9_PD_6: 1;
        uint32_t PAD_P9_PUPDC_6: 1;
        uint32_t PAD_P9_WKEN_6: 1;
        uint32_t PAD_P9_WKPOL_6: 1;
        uint32_t PAD_P9_E2_6: 1;
        uint32_t PAD_P9_SHDN_6: 1;
        uint32_t PAD_P9_S_6: 1;
        uint32_t PAD_P9_DEB_6: 1;
        uint32_t PAD_P9_HS_MUX_6: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P9_O_EN_6: 1;
        uint32_t PAD_P9_O_7: 1;
        uint32_t PAD_P9_E_7: 1;
        uint32_t PAD_P9_PU_EN_7: 1;
        uint32_t AON_PAD_P9_PD_7: 1;
        uint32_t PAD_P9_PUPDC_7: 1;
        uint32_t PAD_P9_WKEN_7: 1;
        uint32_t PAD_P9_WKPOL_7: 1;
        uint32_t PAD_P9_E2_7: 1;
        uint32_t PAD_P9_SHDN_7: 1;
        uint32_t PAD_P9_S_7: 1;
        uint32_t PAD_P9_DEB_7: 1;
        uint32_t PAD_P9_HS_MUX_7: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P9_O_EN_7: 1;
    };
} AON_NS_P9_6_P9_7_PAD_CFG_TYPE;

