rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/aon_reg.h
/* 0x19C0   0x4000_19c0
    0       R/W PAD_P10_O[0]                    1'b0
    1       R/W PAD_P10_E[0]                    1'b0
    2       R/W PAD_P10_PU_EN[0]                1'b1
    3       R/W AON_PAD_P10_PD[0]               1'b1
    4       R/W PAD_P10_PUPDC[0]                1'b0
    5       R/W PAD_P10_WKEN[0]                 1'b0
    6       R/W PAD_P10_WKPOL[0]                1'b0
    7       R/W PAD_P10_E2[0]                   1'b1
    8       R/W PAD_P10_SHDN[0]                 1'b1
    9       R/W PAD_P10_S[0]                    1'b0
    10      R/W PAD_P10_DEB[0]                  1'b0
    11      R/W PAD_P10_HS_MUX[0]               1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P10_O_EN[0]                 1'h1
    16      R/W PAD_P10_O[1]                    1'b0
    17      R/W PAD_P10_E[1]                    1'b0
    18      R/W PAD_P10_PU_EN[1]                1'b1
    19      R/W AON_PAD_P10_PD[1]               1'b1
    20      R/W PAD_P10_PUPDC[1]                1'b0
    21      R/W PAD_P10_WKEN[1]                 1'b0
    22      R/W PAD_P10_WKPOL[1]                1'b0
    23      R/W PAD_P10_E2[1]                   1'b1
    24      R/W PAD_P10_SHDN[1]                 1'b1
    25      R/W PAD_P10_S[1]                    1'b0
    26      R/W PAD_P10_DEB[1]                  1'b0
    27      R/W PAD_P10_HS_MUX[1]               1'b0
    30:28   R   RSVD                            3'b0
    31      R/W PAD_P10_O_EN[1]                 1'h1
 */
typedef volatile union _AON_NS_P10_0_P10_1_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P10_O_0: 1;
        uint32_t PAD_P10_E_0: 1;
        uint32_t PAD_P10_PU_EN_0: 1;
        uint32_t AON_PAD_P10_PD_0: 1;
        uint32_t PAD_P10_PUPDC_0: 1;
        uint32_t PAD_P10_WKEN_0: 1;
        uint32_t PAD_P10_WKPOL_0: 1;
        uint32_t PAD_P10_E2_0: 1;
        uint32_t PAD_P10_SHDN_0: 1;
        uint32_t PAD_P10_S_0: 1;
        uint32_t PAD_P10_DEB_0: 1;
        uint32_t PAD_P10_HS_MUX_0: 1;
        uint32_t RSVD_1: 3;
        uint32_t PAD_P10_O_EN_0: 1;
        uint32_t PAD_P10_O_1: 1;
        uint32_t PAD_P10_E_1: 1;
        uint32_t PAD_P10_PU_EN_1: 1;
        uint32_t AON_PAD_P10_PD_1: 1;
        uint32_t PAD_P10_PUPDC_1: 1;
        uint32_t PAD_P10_WKEN_1: 1;
        uint32_t PAD_P10_WKPOL_1: 1;
        uint32_t PAD_P10_E2_1: 1;
        uint32_t PAD_P10_SHDN_1: 1;
        uint32_t PAD_P10_S_1: 1;
        uint32_t PAD_P10_DEB_1: 1;
        uint32_t PAD_P10_HS_MUX_1: 1;
        uint32_t RSVD: 3;
        uint32_t PAD_P10_O_EN_1: 1;
    };
} AON_NS_P10_0_P10_1_PAD_CFG_TYPE;

/* 0x19C4   0x4000_19c4
    0       R/W PAD_P10_O[2]                    1'b0
    1       R/W PAD_P10_E[2]                    1'b0
    2       R/W PAD_P10_PU_EN[2]                1'b1
    3       R/W AON_PAD_P10_PD[2]               1'b1
    4       R/W PAD_P10_PUPDC[2]                1'b0
    5       R/W PAD_P10_WKEN[2]                 1'b0
    6       R/W PAD_P10_WKPOL[2]                1'b0
    7       R/W PAD_P10_E2[2]                   1'b1
    8       R/W PAD_P10_SHDN[2]                 1'b1
    9       R/W PAD_P10_S[2]                    1'b0
    10      R/W PAD_P10_DEB[2]                  1'b0
    11      R/W PAD_P10_HS_MUX[2]               1'b0
    14:12   R   RSVD                            3'b0
    15      R/W PAD_P10_O_EN[2]                 1'h1
    16      R   RSVD                            1'b0
    17      R   RSVD                            1'b0
    18      R   RSVD                            1'b1
    19      R   RSVD                            1'b1
    20      R   RSVD                            1'b0
    21      R   RSVD                            1'b0
    22      R   RSVD                            1'b0
    23      R   RSVD                            1'b1
    24      R   RSVD                            1'b1
    25      R   RSVD                            1'b0
    26      R   RSVD                            1'b0
    27      R   RSVD                            1'b0
    31:28   R   RSVD                            4'b0
 */
typedef volatile union _AON_NS_P10_2_P10_3_PAD_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P10_O_2: 1;
        uint32_t PAD_P10_E_2: 1;
        uint32_t PAD_P10_PU_EN_2: 1;
        uint32_t AON_PAD_P10_PD_2: 1;
        uint32_t PAD_P10_PUPDC_2: 1;
        uint32_t PAD_P10_WKEN_2: 1;
        uint32_t PAD_P10_WKPOL_2: 1;
        uint32_t PAD_P10_E2_2: 1;
        uint32_t PAD_P10_SHDN_2: 1;
        uint32_t PAD_P10_S_2: 1;
        uint32_t PAD_P10_DEB_2: 1;
        uint32_t PAD_P10_HS_MUX_2: 1;
        uint32_t RSVD_13: 3;
        uint32_t PAD_P10_O_EN_2: 1;
        uint32_t RSVD_12: 1;
        uint32_t RSVD_11: 1;
        uint32_t RSVD_10: 1;
        uint32_t RSVD_9: 1;
        uint32_t RSVD_8: 1;
        uint32_t RSVD_7: 1;
        uint32_t RSVD_6: 1;
        uint32_t RSVD_5: 1;
        uint32_t RSVD_4: 1;
        uint32_t RSVD_3: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 4;
    };
} AON_NS_P10_2_P10_3_PAD_CFG_TYPE;

/* 0x19C8   0x4000_19c8
    0       R/W PAD_E3                          1'b0
    31:1    R   RSVD                            31'b0
 */
typedef volatile union _AON_NS_PAD_E3_CFG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_E3: 1;
        uint32_t RSVD: 31;
    };
} AON_NS_PAD_E3_CFG_TYPE;

/* 0x1AA0   0x4000_1aa0
    0       w1c PAD_P0_STS[0]                   1'b1
    1       w1c PAD_P0_STS[1]                   1'b1
    2       w1c PAD_P0_STS[2]                   1'b1
    3       w1c PAD_P0_STS[3]                   1'b1
    4       w1c PAD_P0_STS[4]                   1'b1
    5       w1c PAD_P0_STS[5]                   1'b1
    6       w1c PAD_P0_STS[6]                   1'b1
    7       w1c PAD_P0_STS[7]                   1'b1
    8       w1c PAD_P1_STS[0]                   1'b1
    9       w1c PAD_P1_STS[1]                   1'b1
    10      w1c PAD_P1_STS[2]                   1'b1
    11      w1c PAD_P1_STS[3]                   1'b1
    12      w1c PAD_P1_STS[4]                   1'b1
    13      w1c PAD_P1_STS[5]                   1'b1
    14      w1c PAD_P1_STS[6]                   1'b1
    15      w1c PAD_P1_STS[7]                   1'b1
    16      w1c PAD_P2_STS[0]                   1'b1
    17      w1c PAD_P2_STS[1]                   1'b1
    18      w1c PAD_P2_STS[2]                   1'b1
    19      w1c PAD_P2_STS[3]                   1'b1
    20      w1c PAD_P2_STS[4]                   1'b1
    21      w1c PAD_P2_STS[5]                   1'b1
    22      w1c PAD_P2_STS[6]                   1'b1
    23      w1c PAD_P2_STS[7]                   1'b1
    24      w1c PAD_P3_STS[0]                   1'b1
    25      w1c PAD_P3_STS[1]                   1'b1
    26      w1c PAD_P3_STS[2]                   1'b1
    27      w1c PAD_P3_STS[3]                   1'b1
    28      w1c PAD_P3_STS[4]                   1'b1
    29      w1c PAD_P3_STS[5]                   1'b1
    30      w1c PAD_P3_STS[6]                   1'b1
    31      w1c PAD_P3_STS[7]                   1'b1
 */
typedef volatile union _AON_NS_PAD_Status_0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P0_STS_0: 1;
        uint32_t PAD_P0_STS_1: 1;
        uint32_t PAD_P0_STS_2: 1;
        uint32_t PAD_P0_STS_3: 1;
        uint32_t PAD_P0_STS_4: 1;
        uint32_t PAD_P0_STS_5: 1;
        uint32_t PAD_P0_STS_6: 1;
        uint32_t PAD_P0_STS_7: 1;
        uint32_t PAD_P1_STS_0: 1;
        uint32_t PAD_P1_STS_1: 1;
        uint32_t PAD_P1_STS_2: 1;
        uint32_t PAD_P1_STS_3: 1;
        uint32_t PAD_P1_STS_4: 1;
        uint32_t PAD_P1_STS_5: 1;
        uint32_t PAD_P1_STS_6: 1;
        uint32_t PAD_P1_STS_7: 1;
        uint32_t PAD_P2_STS_0: 1;
        uint32_t PAD_P2_STS_1: 1;
        uint32_t PAD_P2_STS_2: 1;
        uint32_t PAD_P2_STS_3: 1;
        uint32_t PAD_P2_STS_4: 1;
        uint32_t PAD_P2_STS_5: 1;
        uint32_t PAD_P2_STS_6: 1;
        uint32_t PAD_P2_STS_7: 1;
        uint32_t PAD_P3_STS_0: 1;
        uint32_t PAD_P3_STS_1: 1;
        uint32_t PAD_P3_STS_2: 1;
        uint32_t PAD_P3_STS_3: 1;
        uint32_t PAD_P3_STS_4: 1;
        uint32_t PAD_P3_STS_5: 1;
        uint32_t PAD_P3_STS_6: 1;
        uint32_t PAD_P3_STS_7: 1;
    };
} AON_NS_PAD_Status_0_TYPE;

/* 0x1AA4   0x4000_1aa4
    0       w1c PAD_P4_STS[0]                   1'b1
    1       w1c PAD_P4_STS[1]                   1'b1
    2       w1c PAD_P4_STS[2]                   1'b1
    3       w1c PAD_P4_STS[3]                   1'b1
    4       w1c PAD_P4_STS[4]                   1'b1
    5       w1c PAD_P4_STS[5]                   1'b1
    6       w1c PAD_P4_STS[6]                   1'b1
    7       w1c PAD_P4_STS[7]                   1'b1
    8       w1c PAD_P5_STS[0]                   1'b1
    9       w1c PAD_P5_STS[1]                   1'b1
    10      w1c PAD_P5_STS[2]                   1'b1
    11      w1c PAD_P5_STS[3]                   1'b1
    12      w1c PAD_P5_STS[4]                   1'b1
    13      w1c PAD_P5_STS[5]                   1'b1
    14      w1c PAD_P5_STS[6]                   1'b1
    15      w1c PAD_P5_STS[7]                   1'b1
    16      w1c PAD_P6_STS[0]                   1'b1
    17      w1c PAD_P6_STS[1]                   1'b1
    18      w1c PAD_P6_STS[2]                   1'b1
    19      w1c PAD_P6_STS[3]                   1'b1
    20      w1c PAD_P6_STS[4]                   1'b1
    21      w1c PAD_P6_STS[5]                   1'b1
    22      w1c PAD_P6_STS[6]                   1'b1
    23      w1c PAD_P6_STS[7]                   1'b1
    24      w1c PAD_P7_STS[0]                   1'b1
    25      w1c PAD_P7_STS[1]                   1'b1
    26      w1c PAD_P7_STS[2]                   1'b1
    27      w1c PAD_P7_STS[3]                   1'b1
    28      w1c PAD_P7_STS[4]                   1'b1
    31:29   R   RSVD                            3'b0
 */
typedef volatile union _AON_NS_PAD_Status_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P4_STS_0: 1;
        uint32_t PAD_P4_STS_1: 1;
        uint32_t PAD_P4_STS_2: 1;
        uint32_t PAD_P4_STS_3: 1;
        uint32_t PAD_P4_STS_4: 1;
        uint32_t PAD_P4_STS_5: 1;
        uint32_t PAD_P4_STS_6: 1;
        uint32_t PAD_P4_STS_7: 1;
        uint32_t PAD_P5_STS_0: 1;
        uint32_t PAD_P5_STS_1: 1;
        uint32_t PAD_P5_STS_2: 1;
        uint32_t PAD_P5_STS_3: 1;
        uint32_t PAD_P5_STS_4: 1;
        uint32_t PAD_P5_STS_5: 1;
        uint32_t PAD_P5_STS_6: 1;
        uint32_t PAD_P5_STS_7: 1;
        uint32_t PAD_P6_STS_0: 1;
        uint32_t PAD_P6_STS_1: 1;
        uint32_t PAD_P6_STS_2: 1;
        uint32_t PAD_P6_STS_3: 1;
        uint32_t PAD_P6_STS_4: 1;
        uint32_t PAD_P6_STS_5: 1;
        uint32_t PAD_P6_STS_6: 1;
        uint32_t PAD_P6_STS_7: 1;
        uint32_t PAD_P7_STS_0: 1;
        uint32_t PAD_P7_STS_1: 1;
        uint32_t PAD_P7_STS_2: 1;
        uint32_t PAD_P7_STS_3: 1;
        uint32_t PAD_P7_STS_4: 1;
        uint32_t RSVD: 3;
    };
} AON_NS_PAD_Status_1_TYPE;

/* 0x1AA8   0x4000_1aa8
    0       w1c PAD_32K_XI_STS                  1'b1
    1       w1c PAD_32K_XO_STS                  1'b1
    2       w1c PAD_MICBIAS_STS                 1'b1
    3       w1c PAD_DAC_N_STS                   1'b1
    4       w1c PAD_DAC_P_STS                   1'b1
    31:5    R   RSVD                            27'b0
 */
typedef volatile union _AON_NS_PAD_Status_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_32K_XI_STS: 1;
        uint32_t PAD_32K_XO_STS: 1;
        uint32_t PAD_MICBIAS_STS: 1;
        uint32_t PAD_DAC_N_STS: 1;
        uint32_t PAD_DAC_P_STS: 1;
        uint32_t RSVD: 27;
    };
} AON_NS_PAD_Status_2_TYPE;

/* 0x1AAC   0x4000_1aac
    7:0     R   RSVD                            8'b0
    13:8    R/W debIO_cnt_lmt                   6'b0
    14      R/W debIO_wakeup_en                 1'b0
    15      w1c debIO_wakeup_sts                1'b1
    31:16   R   RSVD                            16'b0
 */
typedef volatile union _AON_NS_REG0X_DEBIO_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD_1: 8;
        uint32_t debIO_cnt_lmt: 6;
        uint32_t debIO_wakeup_en: 1;
        uint32_t debIO_wakeup_sts: 1;
        uint32_t RSVD: 16;
    };
} AON_NS_REG0X_DEBIO_TYPE;

/* 0x1AB0   0x4000_1ab0
    0       w1c PAD_P9_STS[0]                   1'b1
    1       w1c PAD_P9_STS[1]                   1'b1
    2       w1c PAD_P9_STS[2]                   1'b1
    3       w1c PAD_P9_STS[3]                   1'b1
    4       w1c PAD_P9_STS[4]                   1'b1
    5       w1c PAD_P9_STS[5]                   1'b1
    6       w1c PAD_P9_STS[6]                   1'b1
    7       w1c PAD_P9_STS[7]                   1'b1
    8       w1c PAD_P10_STS[0]                  1'b1
    9       w1c PAD_P10_STS[1]                  1'b1
    10      w1c PAD_P10_STS[2]                  1'b1
    11      R   RSVD                            1'b0
    12      R   RSVD                            1'b0
    13      R   RSVD                            1'b0
    14      R   RSVD                            1'b0
    15      R   RSVD                            1'b0
    16      R   RSVD                            1'b0
    17      R   RSVD                            1'b0
    18      R   RSVD                            1'b0
    19      R   RSVD                            1'b0
    20      R   RSVD                            1'b0
    21      R   RSVD                            1'b0
    22      R   RSVD                            1'b0
    23      R   RSVD                            1'b0
    24      R   RSVD                            1'b0
    25      R   RSVD                            1'b0
    26      R   RSVD                            1'b0
    27      R   RSVD                            1'b0
    28      R   RSVD                            1'b0
    31:29   R   RSVD                            3'b0
 */
typedef volatile union _AON_NS_PAD_Status_3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P9_STS_0: 1;
        uint32_t PAD_P9_STS_1: 1;
        uint32_t PAD_P9_STS_2: 1;
        uint32_t PAD_P9_STS_3: 1;
        uint32_t PAD_P9_STS_4: 1;
        uint32_t PAD_P9_STS_5: 1;
        uint32_t PAD_P9_STS_6: 1;
        uint32_t PAD_P9_STS_7: 1;
        uint32_t PAD_P10_STS_0: 1;
        uint32_t PAD_P10_STS_1: 1;
        uint32_t PAD_P10_STS_2: 1;
        uint32_t RSVD_18: 1;
        uint32_t RSVD_17: 1;
        uint32_t RSVD_16: 1;
        uint32_t RSVD_15: 1;
        uint32_t RSVD_14: 1;
        uint32_t RSVD_13: 1;
        uint32_t RSVD_12: 1;
        uint32_t RSVD_11: 1;
        uint32_t RSVD_10: 1;
        uint32_t RSVD_9: 1;
        uint32_t RSVD_8: 1;
        uint32_t RSVD_7: 1;
        uint32_t RSVD_6: 1;
        uint32_t RSVD_5: 1;
        uint32_t RSVD_4: 1;
        uint32_t RSVD_3: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 3;
    };
} AON_NS_PAD_Status_3_TYPE;

/* 0x1AE0   0x4000_1ae0
    31:0    R/W FW_APP_0X                       32'h0
 */
typedef volatile union _AON_NS_REG0X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t reset_reason: 8;
        uint32_t RSVD: 24;
    };
} AON_NS_REG0X_APP_TYPE;

/* 0x1AE4   0x4000_1ae4
    31:0    R/W FW_APP_1X                       32'h0
 */
typedef volatile union _AON_NS_REG1X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_1X;
    };
} AON_NS_REG1X_APP_TYPE;

/* 0x1AE8   0x4000_1ae8
    31:0    R/W FW_APP_2X                       32'h0
 */
typedef volatile union _AON_NS_REG2X_APP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_APP_2X;
    };
} AON_NS_REG2X_APP_TYPE;

